<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[Gökhan Geyik | Sistem Yöneticisi Bir Bey!]]></title><description><![CDATA[Sistem Yöneticisi Bir Bey!]]></description><link>https://www.gokhangeyik.net/</link><image><url>https://www.gokhangeyik.net/favicon.png</url><title>Gökhan Geyik | Sistem Yöneticisi Bir Bey!</title><link>https://www.gokhangeyik.net/</link></image><generator>Ghost 5.49</generator><lastBuildDate>Tue, 06 Jun 2023 17:12:56 GMT</lastBuildDate><atom:link href="https://www.gokhangeyik.net/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[Ghost ve NGINX Proxy Cache]]></title><description><![CDATA[Ghost, bir içerik yönetim sistemi. Modern ve oldukça hızlı. Benim için en büyük cazibesi ise Markdown ile makale yazabilme kolaylığı.]]></description><link>https://www.gokhangeyik.net/ghost-ve-nginx-proxy-cache/</link><guid isPermaLink="false">5ff3a6d08e33d80001053643</guid><category><![CDATA[Ghost]]></category><category><![CDATA[Nginx]]></category><category><![CDATA[OS]]></category><dc:creator><![CDATA[Gökhan Geyik]]></dc:creator><pubDate>Sun, 10 Jan 2021 11:15:00 GMT</pubDate><media:content url="https://www.gokhangeyik.net/content/images/2021/01/ghost-nginx-proxy.jpg" medium="image"/><content:encoded><![CDATA[<img src="https://www.gokhangeyik.net/content/images/2021/01/ghost-nginx-proxy.jpg" alt="Ghost ve NGINX Proxy Cache"><p><a href="https://github.com/TryGhost/Ghost?ref=localhost"><strong>Ghost</strong></a>, bir i&#xE7;erik y&#xF6;netim sistemi. Modern ve olduk&#xE7;a h&#x131;zl&#x131;. Benim i&#xE7;in en b&#xFC;y&#xFC;k cazibesi ise <a href="https://en.wikipedia.org/wiki/Markdown?ref=localhost">Markdown</a> ile makale yazabilme kolayl&#x131;&#x11F;&#x131;.</p><p>Uzun zamand&#x131;r bir aray&#x131;&#x15F;&#x131;n i&#xE7;indeydim. Wordpress art&#x131;k beni bunaltmaya ba&#x15F;lad&#x131; &#xE7;&#xFC;nk&#xFC; bir &#xE7;ok temel eksiklikleri mevcut. Bunlar&#x131; tamamlamak i&#xE7;in pluginler deryas&#x131;nda bo&#x11F;ulmaktan ka&#xE7;am&#x131;yorsunuz. <a href="https://en.wikipedia.org/wiki/Qmail?ref=localhost">Qmail</a> <a href="https://notes.sagredo.eu/en/qmail-notes-185/patching-qmail-82.html?ref=localhost">patch &#xE7;&#x131;lg&#x131;nl&#x131;&#x11F;&#x131;</a> gibi...</p><p>Basit, h&#x131;zl&#x131;, hafif ve kolay kullan&#x131;labilir bir &#x15F;eye ihtiyac&#x131;m vard&#x131;. <a href="https://getgrav.org/?ref=localhost">Grav</a> ilk dura&#x11F;&#x131;m oldu ve i&#x15F;in do&#x11F;rusu ho&#x15F;uma da gitti. &#xDC;zerinde epeyce zaman harcad&#x131;m ve hatta bir s&#xFC;re sitemi yay&#x131;nlad&#x131;m. Neticede kendisi ile de yollar&#x131;m&#x131;z&#x131; ay&#x131;rd&#x131;k malesef. &#xC7;ok detaya girmek istemiyorum.</p><p>Ghost hali haz&#x131;rda zaten olduk&#xE7;a h&#x131;zl&#x131; &#xE7;al&#x131;&#x15F;an bir <a href="https://en.wikipedia.org/wiki/Content_management_system?ref=localhost">CMS</a>. Fakat <a href="https://expressjs.com/?ref=localhost">Express&apos;i</a> oldu&#x11F;u gibi yay&#x131;nlamak fikrine pek s&#x131;cak bakm&#x131;yorum. Bu nedenle &#xF6;n&#xFC;ne bir NGINX yerle&#x15F;tirmeye karar verdim.</p><p>Bu sayede <a href="http://nginx.org/?ref=localhost">NGINX</a> ile bir &#xE7;ok numara yapabilirim. Proxy Cache de bunlardan yaln&#x131;zca bir tanesi.</p><p>Proxy Cache ile t&#xFC;m &#xE7;&#x131;kt&#x131;y&#x131; cacheleyece&#x11F;im ve b&#xF6;ylelikle arkadaki Ghost servisini bir nevi maskelemi&#x15F; olaca&#x11F;&#x131;m. Ayr&#x131;ca Lua ve Ghost&apos;un Webhooklar&#x131;n&#x131; kullanarak, sitede de&#x11F;i&#x15F;ikiller olduk&#xE7;a, cachein tazelenmesini de sa&#x11F;layaca&#x11F;&#x131;m.</p><p>T&#xFC;m yapt&#x131;klar&#x131;m&#x131; ad&#x131;m ad&#x131;m anlataca&#x11F;&#x131; ancak bir par&#xE7;a NGINX biliyor olmak i&#x15F;i kolayla&#x15F;t&#x131;racakt&#x131;r.</p><h2 id="altyap-senaryosu">Altyap&#x131; Senaryosu</h2><p>Elimde bir <strong>Ghost</strong> olacak ve <code>https://www.gokhangeyik.net</code> ile eri&#x15F;ebilece&#x11F;im. Ancak &#xF6;n&#xFC;nde bir <strong>NGINX</strong> olacak ve ilk olarak trafi&#x11F;i kar&#x15F;&#x131;layacak. &#x130;ste&#x11F;e ba&#x11F;l&#x131; olarak, Ghost backend ne cevap verirse, ziyaret&#xE7;iye iletirken ayn&#x131; zamanda da bir sonraki istekler i&#xE7;in 2 saat boyunca cache yapacak.</p><p>Cache purge i&#xE7;in son derece basit bir Lua script kullanaca&#x11F;&#x131;m. &#xC7;&#xFC;nk&#xFC; sitenin i&#xE7;eri&#x11F;i g&#xFC;ncellendi&#x11F;inde t&#xFC;m cache i&#xE7;eri&#x11F;inin temizlenmesi b&#xFC;y&#xFC;k bir problem de&#x11F;il. Ancak daha kompleks purge isteklerini elbette kendiniz de yazabilirsiniz. Tabi bu minvalde kendi webhooklar&#x131;n&#x131;z&#x131; d&#xFC;zenlemeniz gerekir.</p><h2 id="kuruluma-ba-layal-m">Kuruluma Ba&#x15F;layal&#x131;m</h2><p>T&#xFC;m bunlar i&#xE7;in Docker kullanaca&#x11F;&#x131;m. Ancak bu bare metal kurulum yapanlar i&#xE7;in de bir fark yaratmaz. Neticede odakland&#x131;&#x11F;&#x131;m&#x131;z konu NGINX ve Ghost olacak.</p><h3 id="ghost-kurulumu">Ghost Kurulumu</h3><pre><code class="language-plaintext">docker run --name ghost -p 2368:2368 ghost:3-alpine</code></pre><p>Ghost ilk kez &#xE7;al&#x131;&#x15F;t&#x131;&#x11F;&#x131; i&#xE7;in, gerek duydu&#x11F;u bir tak&#x131;m i&#x15F;lemler ger&#xE7;ekle&#x15F;tirecek ve neticede <code>https://www.gokhangeyik.net</code>eri&#x15F;ilebilir hale gelecek.</p><p>Bunu <code>curl</code>ile test edebiliriz.</p><pre><code class="language-plaintext">&#x279C; curl -I https://www.gokhangeyik.net
HTTP/1.1 200 OK
X-Powered-By: Express
Cache-Control: public, max-age=0
Content-Type: text/html; charset=utf-8
Content-Length: 29518
ETag: W/&quot;734e-9ZdP5ZYyAQqraAJyQref33AByfQ&quot;
Vary: Accept-Encoding
Date: Wed, 06 Jan 2021 21:16:43 GMT
Connection: keep-alive
Keep-Alive: timeout=5</code></pre><p>Ghost &#xE7;al&#x131;&#x15F;&#x131;yor ve isteklere yan&#x131;t veriyor. Art&#x131;k devam edebiliriz.</p><h3 id="nginx-kurulumu">NGINX Kurulumu</h3><p>Bunun i&#xE7;in de Docker kullanaca&#x11F;&#x131;m. Basit tutmak i&#xE7;in, contaier temelini Alpine tercih ediyorum. </p><pre><code class="language-plaintext">docker run --name nginx --rm -it -p 80:80 alpine:latest sh</code></pre><p>Art&#x131;k bir Alpine container&#x131;m var ve gerekli paketleri kurabilirim. &#x130;htiyac&#x131;m olan paketler:</p><ul><li>nginx</li><li>nginx-mod-http-lua</li><li>lua-resty-core</li></ul><pre><code class="language-plaintext">apk update
apk add --no-cache nginx nginx-mod-http-lua lua-resty-core</code></pre><p>Amac&#x131;ma ula&#x15F;maya hemen hemen haz&#x131;r&#x131;m ancak burada k&#x131;sa bir bilgi vermem gerekiyor. Her&#x15F;eyi cache etmek ak&#x131;ll&#x131;ca olmayacakt&#x131;r. &#xC7;&#xFC;nk&#xFC; Ghost&apos;un baz&#x131; lokasyonlar&#x131; tam tersine cache edilmemeli. &#xC7;&#xFC;nk&#xFC; bu lokasyonlar, giri&#x15F; yapm&#x131;&#x15F; kullan&#x131;c&#x131;lara ait ara&#xE7;lar&#x131; i&#xE7;eriyor. Burada <code><a href="https://nginx.org/en/docs/http/ngx_http_proxy_module.html?ref=localhost">proxy_cache_bypass</a></code> kullanabilirdim ve cookie bunun i&#xE7;in harika bir belirleyici olabilirdi, ancak ben biraz daha net olmak istiyorum ve bu nedenle <code><a href="http://nginx.org/en/docs/http/ngx_http_core_module.html?ref=localhost#location">location</a></code> konteksti ile bu &#xF6;zel alanlar&#x131; ayr&#x131; tutaca&#x11F;&#x131;m.</p><pre><code class="language-nginx">proxy_cache_path /var/cache/nginx/ levels=1:2 keys_zone=ghost_cache:10m max_size=512m inactive=2h;
proxy_cache_key &quot;$request_method$host$request_uri&quot;;
proxy_cache_methods GET HEAD;</code></pre><p>Yukar&#x131;daki direktifler <code>http</code> kontekstinin i&#xE7;inde olmal&#x131;. &#x15E;imdi tek tek ne yapt&#x131;&#x11F;&#x131;m&#x131; anlataca&#x11F;&#x131;m.</p><p><code>proxy_cache_path</code>, yapaca&#x11F;&#x131;m i&#x15F;lem i&#xE7;in olduk&#xE7;a kritik. Cache edilmi&#x15F; isteklere ait dosyalar&#x131;n, nerede, ne &#x15F;ekilde ve ne kadar s&#xFC;reyle tutulmas&#x131;n&#x131; istedi&#x11F;imi belirtebilmemi sa&#x11F;lar. Ayr&#x131;ca bu dosyalar&#x131;n byte cinsinden kaplayabilece&#x11F;i en fazla alan&#x131; da limitleyebilirim.</p><p>&#xD6;rne&#x11F;imden gidecek olursam, cache istekleri <code>/var/cache/nginx</code> dizininde depolanacak.</p><p><code>level=1:2</code> ise bu cache &#xE7;&#x131;kt&#x131;lar&#x131;n&#x131;n hiyerar&#x15F;ik olarak d&#xFC;zenini belirtiyor. NGINX, cache &#xE7;&#x131;kt&#x131;lar&#x131;n&#x131; <code><a href="https://en.wikipedia.org/wiki/MD5?ref=localhost">MD5</a></code> ile isimlendirir. Yani g&#xFC;n&#xFC;n sonunda a&#x15F;a&#x11F;&#x131;daki gibi dosya isimlerine sahip olaca&#x11F;&#x131;m.</p><figure class="kg-card kg-code-card"><pre><code class="language-plaintext">bash-5.1# ls -Al
total 32
drwx------    3 nginx    nginx         4096 Jan 10 08:40 3
drwx------    3 nginx    nginx         4096 Jan 10 08:41 4
drwx------    3 nginx    nginx         4096 Jan 10 08:40 6
drwx------    4 nginx    nginx         4096 Jan 10 08:41 8
drwx------    3 nginx    nginx         4096 Jan 10 08:40 9
drwx------    3 nginx    nginx         4096 Jan 10 08:40 d
drwx------    3 nginx    nginx         4096 Jan 10 08:41 e
drwx------    3 nginx    nginx         4096 Jan 10 08:40 f</code></pre><figcaption>/var/cache/nginx</figcaption></figure><p>&#xD6;rnek olarak <code>8</code> dizininin i&#xE7;eri&#x11F;ine bakal&#x131;m.</p><pre><code class="language-plaintext">bash-5.1# cd /var/cache/nginx/8/
bash-5.1# find .
.
./ca
./ca/31b4504a91cc38c996e2dff211e59ca8
./2e
./2e/b999904f61cd8ade87149edef72dd2e8</code></pre><p>Yani NGINX, olu&#x15F;turdu&#x11F;u bu dosya isimlerinden sonran 1. karakteri ilk seviye dizin olarak olu&#x15F;turuyor. Bundan sonra gelen 2 karakteri de -<em>ki bizim &#xE7;&#x131;kt&#x131;m&#x131;zda bu <code>ca</code> ve <code>2e</code></em>- bir alt dizin olarak olu&#x15F;turup, cache &#xE7;&#x131;kt&#x131;s&#x131;n&#x131; burada sakl&#x131;yor.</p><p><code>keys_zone</code> bir &#xE7;e&#x15F;it index olarak d&#xFC;&#x15F;&#xFC;n&#xFC;lebilir. Cache dosyalar&#x131;n&#x131;n anahtarlar&#x131; burada tutuluyor. NGINX d&#xF6;k&#xFC;man&#x131;na g&#xF6;re 1 Mbyte boyutundan bir zone 8.000 anahtar saklayabiliyor. Asl&#x131;nda 10 Mbyte dahi benim i&#xE7;in b&#xFC;y&#xFC;k bir alan.</p><p><code>max_size</code> ise ad&#x131; &#xFC;zerinde, cache dosyalar&#x131;n&#x131;n belirtilen dizin i&#xE7;erisinde kaplayabilece&#x11F;i maksimum disk alan&#x131;.</p><p><code>inactive</code> ise bir pasif cache anahtar&#x131;n&#x131;n maksimum s&#xFC;resini belirtiyor. E&#x11F;er cache edilmi&#x15F; bir dosyaya, bu s&#xFC;re zarf&#x131;nda hi&#xE7; eri&#x15F;ilmemi&#x15F; ise, cache durumu ne olursa olsun NGINX silecektir.</p><p><code>proxy_cache_key</code>, keys_zone i&#xE7;erisinde tutulacak anahtarlar&#x131; isimlendirmek i&#xE7;in bir &#x15F;ablon. Bu y&#xF6;nerge bir &#xE7;ok ama&#xE7; i&#xE7;in kullan&#x131;labilir. E&#x11F;er responsive bir web &#xA0;uygulamas&#x131; kullanm&#x131;yorsan&#x131;z, mobil ve masa &#xFC;st&#xFC; istemcileri i&#xE7;in farkl&#x131; cacheler &#xFC;retebilirsiniz.</p><p>Ve son olarak <code>proxy_cache_methods</code> ise istedi&#x11F;im <a href="https://developer.mozilla.org/en-US/docs/Web/HTTP/Methods?ref=localhost">HTTP istek metodlar&#x131;n&#x131;</a> cache i&#xE7;in se&#xE7;meme yard&#x131;mc&#x131; oluyor.</p><p>Devam&#x131;nda art&#x131;k cache yapmak istedi&#x11F;im ve cache d&#x131;&#x15F;&#x131;nda tutmak istedi&#x11F;im lokasyonlar&#x131; belirleyip yay&#x131;nlamaya ba&#x15F;layabilirim. </p><pre><code class="language-nginx">location / {
            proxy_hide_header x-powered-by;
            proxy_hide_header Etag;
            proxy_redirect off;

            proxy_pass http://ghost:2368;

            proxy_cache ghost_cache;
            proxy_cache_valid 200 60m;
            proxy_cache_valid 404 3m;
            proxy_cache_revalidate off;
            proxy_ignore_headers X-Accel-Expires Expires Cache-Control;
            add_header X-NGINX-Cache $upstream_cache_status;
        }</code></pre><p>Tek tek parametreleri tan&#x131;tmak ve anlatmak istemiyorum o nedenlen buradan sonras&#x131;n&#x131; biraz daha h&#x131;zl&#x131; devam edece&#x11F;im. <code>location /</code> Hemen her yeri kapsayan bir cache tan&#x131;m&#x131; oldu. <code>HTTP 200</code> 60 dakika boyunca, <code>HTTP 404</code> ise 3 dakika boyunca cache olacak. Bir tak&#x131;m HTTP ba&#x15F;l&#x131;klar&#x131;n&#x131; gizlemeyi tercih ettim.</p><p>Buraya gelen t&#xFC;m istekler, e&#x11F;er <code>keys_zone</code> i&#xE7;erisinde de&#x11F;ilse <code>proxy_pass</code> marifetiyle ghost ismine sahip containera gidecek. Son olarak da bir belirleyici ekledim ki cache i&#x15F;e yar&#x131;yor mu g&#xF6;rebileyim. </p><p>&#xD6;nemli iki alan var ki onlar&#x131; cache etmemeliyim. Bunlardan biri Ghost&apos;un y&#xF6;netim ara y&#xFC;z&#xFC;, di&#x11F;eri ise g&#xF6;nderileri &#xF6;n izleme yapmama yarayan alan. A&#x15F;a&#x11F;&#x131;daki kontekst i&#x15F;ime yarayacakt&#x131;r.</p><pre><code class="language-nginx">location ~* ^(/ghost/|/p/) {
            proxy_hide_header x-powered-by;
            proxy_hide_header Etag;
            proxy_redirect off;

            proxy_pass http://ghost:2368;
            break;
        }</code></pre><p>&#x15E;imdi bunlar&#x131; bir araya getirip ilk testlere ba&#x15F;layay&#x131;m. Testlerimde <code>curl</code> ve <code><a href="https://github.com/davecheney/httpstat?ref=localhost">httpstat</a></code> kullanaca&#x11F;&#x131;m ve konfig&#xFC;rasyonum &#x15F;u &#x15F;ekilde g&#xF6;r&#xFC;necek.</p><pre><code class="language-nginx">proxy_cache_path /var/cache/nginx/ levels=1:2 keys_zone=ghost_cache:75m max_size=512m inactive=2h;
proxy_cache_key &quot;$request_method$host$request_uri&quot;;
proxy_cache_methods GET HEAD;

server {
    listen 80;

    location ~* ^(/ghost/|/p/) {
        proxy_hide_header x-powered-by;
        proxy_hide_header Etag;
        proxy_redirect off;

        proxy_pass http://ghost:2368;
        break;
    }

    location / {
        proxy_hide_header x-powered-by;
        proxy_hide_header Etag;
        proxy_redirect off;

        proxy_pass http://ghost:2368;

        proxy_cache ghost_cache;
        proxy_cache_valid 200 60m;
        proxy_cache_valid 404 3m;
        proxy_cache_revalidate off;
        proxy_ignore_headers X-Accel-Expires Expires Cache-Control;
        add_header X-NGINX-Cache $upstream_cache_status;
    }
}</code></pre><p>&#x130;lk olarak Ghost&apos;u direk eri&#x15F;im ile test edece&#x11F;im. S&#xF6;yledi&#x11F;im gibi asl&#x131;nda Ghost olduk&#xE7;a h&#x131;zl&#x131; &#xE7;al&#x131;&#x15F;an bir i&#xE7;erik y&#xF6;netim sistemi.</p><pre><code class="language-plaintext">&#x279C; httpstat https://www.gokhangeyik.net
Connected to ::1:2368 from ::1:56947

HTTP/1.1 200 OK
X-Powered-By: Express
Cache-Control: public, max-age=0
Content-Type: text/html; charset=utf-8
Content-Length: 29518
ETag: W/&quot;734e-7qGhBLEw4KHXjVrEObfphnPgXMc&quot;
Vary: Accept-Encoding
Date: Sun, 10 Jan 2021 10:14:37 GMT
Connection: keep-alive
Keep-Alive: timeout=5

  DNS Lookup   TCP Connection   Server Processing   Content Transfer
[     1ms    |       0ms      |       57ms        |        1ms       ]
             |                |                   |                  |
    namelookup:1ms            |                   |                  |
                        connect:1ms               |                  |
                                      starttransfer:58ms             |
                                                                 total:59ms</code></pre><p>Test blogunun ana sayfas&#x131; 58ms i&#xE7;erisinde eri&#x15F;ilir hale geldi. Bu olduk&#xE7;a iyi. Tabi <code>httpstat</code> maalesef javascript &#xE7;al&#x131;&#x15F;t&#x131;rm&#x131;yor. Bu s&#xFC;re reel de&#x11F;il. Yaln&#x131;zca &#xE7;&#x131;kar&#x131;m yapmama yard&#x131;m edecek.</p><p>&#x15E;imdi ayn&#x131; iste&#x11F;i NGINX proxy &#xFC;zerinden yapaca&#x11F;&#x131;m. &#x130;lk iste&#x11F;im cache edilmemi&#x15F; olaca&#x11F;&#x131;ndan 58ms&apos;den daha uzun olma ihtimali var.</p><pre><code class="language-plaintext">&#x279C; httpstat http://localhost
Connected to ::1:80 from ::1:57112

HTTP/1.1 200 OK
Server: nginx
Date: Sun, 10 Jan 2021 10:19:06 GMT
Content-Type: text/html; charset=utf-8
Content-Length: 29532
Connection: keep-alive
Cache-Control: public, max-age=0
Vary: Accept-Encoding
X-NGINX-Cache: MISS

  DNS Lookup   TCP Connection   Server Processing   Content Transfer
[     2ms    |       0ms      |       68ms        |        0ms       ]
             |                |                   |                  |
    namelookup:2ms            |                   |                  |
                        connect:2ms               |                  |
                                      starttransfer:70ms             |
                                                                 total:70ms</code></pre><p>Bekledi&#x11F;im gibi oldu ve gayet makul. &#x130;lk istek 70ms kadar s&#xFC;rd&#xFC; ve <code>X-NGINX-Cache: MISS</code> header&#x131; hen&#xFC;z cache edilmedi&#x11F;ini g&#xF6;steriyor. Bundan sonraki iste&#x11F;im direk olarak NGINX cache olacak ve arada ciddi bir h&#x131;z fark&#x131; olmas&#x131;n&#x131; bekliyorum.</p><pre><code class="language-plaintext">&#x279C; httpstat http://localhost
Connected to ::1:80 from ::1:57190

HTTP/1.1 200 OK
Server: nginx
Date: Sun, 10 Jan 2021 10:21:21 GMT
Content-Type: text/html; charset=utf-8
Content-Length: 29532
Connection: keep-alive
Cache-Control: public, max-age=0
Vary: Accept-Encoding
X-NGINX-Cache: HIT

  DNS Lookup   TCP Connection   Server Processing   Content Transfer
[     1ms    |       0ms      |        3ms        |        0ms       ]
             |                |                   |                  |
    namelookup:1ms            |                   |                  |
                        connect:1ms               |                  |
                                      starttransfer:4ms              |
                                                                 total:4ms</code></pre><p>Toplam s&#xFC;re 4ms. M&#xFC;kemmel bir sonu&#xE7;. <code>X-NGINX-Cache: HIT</code> Art&#x131;k cevab&#x131;n Ghost&apos;tan de&#x11F;il NGINX&apos;ten geldi&#x11F;ini biliyorum.&#xD6;te yandan art&#x131;k Ghost&apos;u dert etmek zorunda de&#x11F;ilim. Cache oldu&#x11F;u m&#xFC;ddet&#xE7;e, y&#xFC;ksek bir trafik ile kar&#x15F;&#x131;la&#x15F;mayacak.</p><p>&#x15E;imdi s&#x131;ra bu cache i&#xE7;eri&#x11F;ini temizlemekte. &#x130;&#x15F;tiyorum ki sitemde bir de&#x11F;i&#x15F;iklik yapt&#x131;&#x11F;&#x131;mda, bu cache tamamen silinsin ve ben de de&#x11F;i&#x15F;iklikleri g&#xF6;rebileyim. Bunun i&#xE7;in iki &#x15F;eye ihtiyac&#x131;m var.</p><ol><li>NGINX purge lokasyonu</li><li>Ghost i&#xE7;erisinde bunu tetikleyebilecek bir mekanizma.</li></ol><p>Bunlar&#x131;n hepsine sahibim. NGINX konfig&#xFC;rasyonumu a&#x15F;a&#x11F;&#x131;daki &#x15F;ekilde g&#xFC;ncelliyorum.</p><pre><code class="language-nginx">proxy_cache_path /var/cache/nginx/ levels=1:2 keys_zone=ghost_cache:75m max_size=512m inactive=2h;
proxy_cache_key &quot;$request_method$host$request_uri&quot;;
proxy_cache_methods GET HEAD;

server {
    listen 80;

    location ~* ^(/ghost/|/p/) {
        proxy_hide_header x-powered-by;
        proxy_hide_header Etag;
        proxy_redirect off;

        proxy_pass http://ghost:2368;
        break;
    }

    location / {
        proxy_hide_header x-powered-by;
        proxy_hide_header Etag;
        proxy_redirect off;

        proxy_pass http://ghost:2368;

        proxy_cache ghost_cache;
        proxy_cache_valid 200 60m;
        proxy_cache_valid 404 3m;
        proxy_cache_revalidate off;
        proxy_ignore_headers X-Accel-Expires Expires Cache-Control;
        add_header X-NGINX-Cache $upstream_cache_status;
    }
location /purgethecache {
        content_by_lua_block {
            os.execute(&quot;/bin/rm -rf /var/cache/nginx/*&quot;)
        }
    }
}</code></pre><p><code>purgethecache</code> isminde bir lokasyon ekledim ve olduk&#xE7;a basit bir lua direktifi &#xE7;al&#x131;&#x15F;t&#x131;r&#x131;yorum. Buraya gelen her istek ile birlikte <code>/var/cache/nginx</code> dizininin i&#xE7;eri&#x11F;i temizlenecek ve b&#xF6;ylece cache yok edilmi&#x15F; olacak.</p><p>Her Ghost blog bir y&#xF6;netim aray&#xFC;z&#xFC;ne sahip. Bu aray&#xFC;zde <code>Integrations</code> b&#xF6;l&#xFC;m&#xFC; mevcut. Bu b&#xF6;l&#xFC;mden bir <code>Custom Integration</code> ekleyece&#x11F;im.</p><figure class="kg-card kg-image-card kg-width-wide kg-card-hascaption"><img src="https://www.gokhangeyik.net/content/images/2021/01/Ghost-Custom-Integrations.jpg" class="kg-image" alt="Ghost ve NGINX Proxy Cache" loading="lazy" width="2000" height="1146" srcset="https://www.gokhangeyik.net/content/images/size/w600/2021/01/Ghost-Custom-Integrations.jpg 600w, https://www.gokhangeyik.net/content/images/size/w1000/2021/01/Ghost-Custom-Integrations.jpg 1000w, https://www.gokhangeyik.net/content/images/size/w1600/2021/01/Ghost-Custom-Integrations.jpg 1600w, https://www.gokhangeyik.net/content/images/size/w2400/2021/01/Ghost-Custom-Integrations.jpg 2400w" sizes="(min-width: 1200px) 1200px"><figcaption>Ghost Custom Integrations</figcaption></figure><p>&#x15E;imdi de bu entegrasyona bir Webhook ekleyece&#x11F;im. Yani Ghost, sitede herhangi bir de&#x11F;i&#x15F;iklik olunca, gidip <code>purgethecache</code> lokasyonunu ziyaret edecek. NGINX de tan&#x131;mland&#x131;&#x11F;&#x131; gibi cache i&#xE7;eri&#x11F;ini silecek.</p><figure class="kg-card kg-image-card kg-width-wide kg-card-hascaption"><img src="https://www.gokhangeyik.net/content/images/2021/01/Ghost-Webhook.jpg" class="kg-image" alt="Ghost ve NGINX Proxy Cache" loading="lazy" width="2000" height="1145" srcset="https://www.gokhangeyik.net/content/images/size/w600/2021/01/Ghost-Webhook.jpg 600w, https://www.gokhangeyik.net/content/images/size/w1000/2021/01/Ghost-Webhook.jpg 1000w, https://www.gokhangeyik.net/content/images/size/w1600/2021/01/Ghost-Webhook.jpg 1600w, https://www.gokhangeyik.net/content/images/size/w2400/2021/01/Ghost-Webhook.jpg 2400w" sizes="(min-width: 1200px) 1200px"><figcaption>Ghost Webhook</figcaption></figure><p>Hedefime ula&#x15F;t&#x131;m. Art&#x131;k cal&#x131;&#x15F;an bir cache mekanizmam ve purge mekanizmam mevcut. Bu konfigurasyon elbette geli&#x15F;tiriebilir ve ben elimden geldi&#x11F;ince sadele&#x15F;tirerek anlatmak istedim.</p><p></p>]]></content:encoded></item><item><title><![CDATA[Almanya'da Bilişimci Olmak]]></title><description><![CDATA[Türkiye'de birçok bilişim çalışanının aklının bir köşesinde, yeteneklerini yurt dışında değerlendirmek olduğunu biliyorum. Ancak sayısız gerekçelerle bunu erteliyoruz.]]></description><link>https://www.gokhangeyik.net/almanyada-bilisimci-olmak/</link><guid isPermaLink="false">5ff210635ad9ea0001ab0379</guid><category><![CDATA[Hayat]]></category><category><![CDATA[İş Hayatı]]></category><category><![CDATA[Almanya]]></category><dc:creator><![CDATA[Gökhan Geyik]]></dc:creator><pubDate>Wed, 19 Aug 2020 17:44:00 GMT</pubDate><media:content url="https://www.gokhangeyik.net/content/images/2021/01/Mountain-Landscape.jpg" medium="image"/><content:encoded><![CDATA[<img src="https://www.gokhangeyik.net/content/images/2021/01/Mountain-Landscape.jpg" alt="Almanya&apos;da Bili&#x15F;imci Olmak"><p>T&#xFC;rkiye&apos;de bir&#xE7;ok bili&#x15F;im &#xE7;al&#x131;&#x15F;an&#x131;n&#x131;n akl&#x131;n&#x131;n bir k&#xF6;&#x15F;esinde, yeteneklerini yurt d&#x131;&#x15F;&#x131;nda de&#x11F;erlendirmek oldu&#x11F;unu biliyorum. Ancak say&#x131;s&#x131;z gerek&#xE7;elerle bunu erteliyoruz. T&#xFC;rkiye&apos;de 2003 y&#x131;l&#x131;nda ba&#x15F;layan bili&#x15F;im hayat&#x131;m&#x131;n 2019&apos;un A&#x11F;ustos&apos;unda Almanya&apos;ya ta&#x15F;&#x131;nmas&#x131;n&#x131;n ad&#x131;mlar&#x131;n&#x131; anlatmaya karar verdim. De&#x11F;i&#x15F;iklik yapmak i&#xE7;in asla ge&#xE7; de&#x11F;ildir!</p><p>Hikayenin tamam&#x131;n&#x131; bir yaz&#x131;da anlatmak yerine, farkl&#x131; b&#xF6;l&#xFC;mlere ay&#x131;r&#x131;p bir &#xE7;ok soruya detayl&#x131; yan&#x131;tlar verebilmeyi ama&#xE7;l&#x131;yorum. &#x130;lk yaz&#x131;da T&#xFC;rkiye&apos;de bili&#x15F;imci olmak ile Almanya&apos;da bili&#x15F;imci olmay&#x131; k&#x131;yaslamak istiyorum.</p><h2 id="t-rkiye-de-bili-imci-olmak">T&#xFC;rkiye&apos;de bili&#x15F;imci olmak</h2><p>Bili&#x15F;im sekt&#xF6;r&#xFC;ndeki ilk profesyonel i&#x15F; tecr&#xFC;bem 2003 y&#x131;l&#x131;nda ba&#x15F;lad&#x131;. Ben bir sistem y&#xF6;neticisiyim ve bu karar&#x131; son derece bilin&#xE7;li olarak ald&#x131;m. Tercihimde herhangi bir rastgelelik olmad&#x131;&#x11F;&#x131;ndan, ne istedi&#x11F;imi ve ne yapmam gerekti&#x11F;ini bilir bir &#x15F;ekilde ilk i&#x15F;ime at&#x131;ld&#x131;m.<br>&#x130;lkokul y&#x131;llar&#x131;mdan bu yana bilgisayarlarla hep i&#xE7; i&#xE7;e oldum ve bir bili&#x15F;im merakl&#x131;s&#x131; klasi&#x11F;i olarak ilk <a href="https://en.wikipedia.org/wiki/BASIC?ref=localhost">BASIC</a> kodlar&#x131;m&#x131; ortaokul y&#x131;llar&#x131;mda, &#xF6;rnek kodlar&#x131; deneyerek tamamlad&#x131;m.<br>Bu benim i&#xE7;in bamba&#x15F;ka bir tecr&#xFC;beydi ve b&#xFC;y&#xFC;lenmi&#x15F; hissettim. O andan itibaren bilgisayarlara dair her &#x15F;eyi &#xF6;&#x11F;renmeye ve bilgisayarlarla ilgili bir i&#x15F; sahibi olmaya karar verdim.</p><p>Birka&#xE7; programlama dili &#xF6;&#x11F;rendikten sonra i&#x15F;letim sistemleri ve a&#x11F; teknolojileri ile de ilgilenmeye ba&#x15F;lad&#x131;m. G&#xFC;n&#xFC;n sonunda, kendimce edindi&#x11F;im amat&#xF6;r tecr&#xFC;beler, bir teknoloji &#x15F;irketinde sistem y&#xF6;neticisi olmam&#x131; sa&#x11F;lad&#x131;.</p><p>2003&apos;ten 2019 y&#x131;l&#x131;na kadar T&#xFC;rkiye&apos;de tam zamanl&#x131; olarak 2 farkl&#x131; &#x15F;irkette &#xE7;al&#x131;&#x15F;t&#x131;m. &#x130;lk i&#x15F;imde 12 y&#x131;l, 2. i&#x15F;imde ise 3 y&#x131;l &#xE7;al&#x131;&#x15F;t&#x131;m. Bununla birlikte say&#x131;s&#x131; 200&apos;e yakla&#x15F;an ve <a href="https://en.wikipedia.org/wiki/Freelancer?ref=localhost">freelance</a> olarak adland&#x131;r&#x131;lan ek i&#x15F;lerde de bulundum.<br>B&#xFC;t&#xFC;n bunlar, T&#xFC;rkiye&apos;de bili&#x15F;imci olman&#x131;n nas&#x131;l oldu&#x11F;una dair bir fikir edinmemi sa&#x11F;lad&#x131;.</p><h3 id="t-rkiye-de-beklentiler">T&#xFC;rkiye&apos;de beklentiler</h3><p>&#xC7;al&#x131;&#x15F;anlar&#x131;n, y&#xF6;neticilerin ve i&#x15F;verenlerin birbirlerinden beklentileri farkl&#x131;d&#x131;r. Ancak yaz&#x131;mdaki perspektif &#xE7;al&#x131;&#x15F;an taraf&#x131; olacak.<br>Biz bili&#x15F;imciler genellikle sessiz, konforlu bir &#xE7;al&#x131;&#x15F;ma ortam&#x131;ndan ho&#x15F;lan&#x131;yoruz. Yapt&#x131;&#x11F;&#x131;m&#x131;z &#xE7;o&#x11F;u i&#x15F; y&#xFC;ksek dikkat gerektirdi&#x11F;i i&#xE7;in, dikkat da&#x11F;&#x131;t&#x131;c&#x131; &#xF6;&#x11F;eler t&#xFC;m performans&#x131;m&#x131;z&#x131; k&#xF6;k&#xFC;nden etkiler. Malesef T&#xFC;rkiye&apos;de hi&#xE7;bir i&#x15F;imde ya da projemde bu k&#x131;sm&#x131; kavrayabilmi&#x15F; bir y&#xF6;netici ya da i&#x15F;verene rastlayamad&#x131;m.<br>Bir k&#x131;sm&#x131; biraz daha &#xF6;zenli, bir k&#x131;sm&#x131; biraz daha &#xF6;zensiz... Ancak neticesinde sonu&#xE7; hi&#xE7; optimum olmad&#x131;. Buraya dikkatinizi &#xE7;ekmek istiyorum. Maksimum demiyorum, optimum dahi olamad&#x131;.</p><p>Ki&#x15F;ilerin &#xF6;zel hayatlar&#x131;n&#x131;n, i&#x15F; hayatlar&#x131;ndan &#xE7;ok daha &#xF6;nemli oldu&#x11F;u ger&#xE7;e&#x11F;inin idrak edilemeyi&#x15F;i bir &#xE7;ok sorunun ana nedenidir.<br>&#xDC;&#xE7; a&#x15F;a&#x11F;&#x131; be&#x15F; yukar&#x131; haftal&#x131;k 40 saat &#xE7;al&#x131;&#x15F;ma s&#xFC;resinin bedelinin &#xF6;dendi&#x11F;i bir i&#x15F; hayat&#x131;nda, bundan 1 saniye daha fazlas&#x131;n&#x131; talep etmenin b&#xFC;y&#xFC;k bir c&#xFC;ret oldu&#x11F;unu bilmek gerekir. Bu c&#xFC;retin &#xE7;al&#x131;&#x15F;ana makul bir fayda sa&#x11F;lamas&#x131; gerekir ve bu fayda iki taraf&#x131;n da onay&#x131;n&#x131; gerektirir.</p><p>Kar&#x15F;&#x131;l&#x131;ks&#x131;z fazla mesai s&#xF6;m&#xFC;r&#xFC;s&#xFC;, bireyleri iste&#x11F;i d&#x131;&#x15F;&#x131;nda h&#xFC;rriyetinden yoksun b&#x131;rakmaktan &#xE7;ok farkl&#x131; de&#x11F;ildir. Fazla mesai yapmal&#x131;s&#x131;n&#x131;z yoksa i&#x15F;inizden olabilirsiniz. Kar&#x15F;&#x131;l&#x131;k beklemeniz ise y&#xFC;zs&#xFC;zl&#xFC;k olarak dahi nitelendirilebilir.<br>Bu zamana kadar edindi&#x11F;im tecr&#xFC;beye g&#xF6;re, hayat&#x131;n&#x131;z&#x131;n zerre kadar k&#x131;ymeti yoktur. Zaten kazand&#x131;&#x11F;&#x131;n&#x131;z para ile de en iyi ihtimalle orta halli bir hayat s&#xFC;rersiniz.</p><p>Genel olarak y&#xF6;neticilerle sorun &#xE7;&#xF6;zmek, T&#xFC;rkiye &#x15F;artlar&#x131;nda gereksiz bir efordur. Bir k&#x131;s&#x131;m y&#xF6;neticinin sorun &#xE7;&#xF6;zebilecek kabiliyeti olmad&#x131;&#x11F;&#x131; gibi bir k&#x131;s&#x131;m y&#xF6;neticinin de sorun &#xE7;&#xF6;zebilecek yetkisi bulunmuyor. Hatta bir &#xE7;o&#x11F;u d&#xFC;&#x15F;&#xFC;ncelerini ifade edebilecek &#xF6;l&#xE7;&#xFC;de ileti&#x15F;im becerisine dahi sahip de&#x11F;il.<br>Bunun neticesinde s&#xFC;rekli olarak s&#x131;zlanan bir &#xE7;al&#x131;&#x15F;an kitlesi olarak yaftalanmaktan ka&#xE7;am&#x131;yorsunuz. Halbuki ortada &#xE7;&#xF6;z&#xFC;lemeyen bir sorun varsa, yar&#x131;n da &#xE7;&#xF6;z&#xFC;lmemi&#x15F; olacak ve ayn&#x131; rahats&#x131;zl&#x131;&#x11F;&#x131; yaratan bir sorun olarak varl&#x131;&#x11F;&#x131;na devam edecektir.<br>&#xC7;&#xF6;z&#xFC;mlenmemi&#x15F; sorunlar&#x131;n kendili&#x11F;inden ortadan kalkmad&#x131;&#x11F;&#x131;n&#x131; anlatabilmenin bir yolu oldu&#x11F;unu sanm&#x131;yorum.</p><p>Netice olarak halen T&#xFC;rkiye&apos;de eme&#x11F;ini bili&#x15F;im sekt&#xF6;r&#xFC;nde ak&#x131;tan meslekta&#x15F;lar&#x131;ma tavsiyemdir. Beklentilerinizi m&#xFC;mk&#xFC;n oldu&#x11F;unca d&#xFC;&#x15F;&#xFC;k tutun. B&#xF6;ylece daha az y&#x131;pran&#x131;rs&#x131;n&#x131;z.</p><h3 id="t-rkiye-de-i-hayat-ve-zel-hayat-dengesi">T&#xFC;rkiye&apos;de i&#x15F; hayat&#x131; ve &#xF6;zel hayat dengesi</h3><p>Bu dengenin T&#xFC;rkiye&apos;de bulundu&#x11F;una inanmak i&#xE7;in bir nedemin yok diyerek, tekmeyle kap&#x131;y&#x131; k&#x131;rmak suretiyle konuya gireyim. Bireylerin birbirine sayg&#x131; d&#xFC;zeylerinin &#xE7;ok a&#x15F;a&#x11F;&#x131;da oldu&#x11F;u bir toplumda, &#x15F;irket gibi hiyerar&#x15F;ik bir olu&#x15F;um i&#xE7;erisinde bu sayg&#x131;y&#x131; aramak fazlas&#x131;yla komik olur.<br>Elbette i&#x15F; hayat&#x131;n&#x131;z, &#xF6;zel hayat&#x131;n&#x131;za sayg&#x131; duymayacakt&#x131;r. Elbette mesai sonunda gitmek istedi&#x11F;iniz konser &#x15F;irketinizin umrunda bile de&#x11F;il. Yahu elbette y&#xF6;neticiniz sizin haftasonu plan&#x131;n&#x131;z&#x131; duymak istemiyor.<br>&#x130;&#x15F; oldu&#x11F;u m&#xFC;ddet&#xE7;e &#xE7;al&#x131;&#x15F;mal&#x131;s&#x131;n&#x131;z. &#xC7;&#xFC;nk&#xFC; i&#x15F;, hayatta kald&#x131;&#x11F;&#x131;n&#x131;z m&#xFC;ddet&#xE7;e sizden daha &#xF6;nemli. &#x130;&#x15F; yapabilecek sa&#x11F;l&#x131;ktaysan&#x131;z, kah tatl&#x131; sert tav&#x131;rlarla, kah g&#xF6;n&#xFC;l alarak ya da kah k&#xFC;&#xE7;&#xFC;k vaatler verilerek &#xE7;al&#x131;&#x15F;t&#x131;r&#x131;lacaks&#x131;n&#x131;z.</p><h3 id="t-rkiye-de-cretlerin-belirlenme-s-reci">T&#xFC;rkiye&apos;de &#xFC;cretlerin belirlenme s&#xFC;reci</h3><p>Teknik olarak her &#x15F;irket &#xE7;al&#x131;&#x15F;an&#x131;, bulundu&#x11F;u &#x15F;irkete kendi i&#x15F; g&#xFC;c&#xFC;n&#xFC; satan bir sat&#x131;c&#x131;d&#x131;r. Ancak bu ili&#x15F;ki asla iki &#x15F;irketin bir biririne &#xFC;r&#xFC;n ya da hizmet satmas&#x131; e&#x15F;itli&#x11F;inde de&#x11F;ildir.<br>&#xC7;al&#x131;&#x15F;an, kazanmak istedi&#x11F;i paray&#x131; k&#x131;smen belirler ya da hi&#xE7; belirleyemez. Genellikle sunulana kabul g&#xF6;sterir ya da biraz daha fazlas&#x131;n&#x131; elde edebilir. &#xC7;al&#x131;&#x15F;an&#x131;n kendi i&#x15F; g&#xFC;c&#xFC;n&#xFC; tan&#x131;tma ve pazarlama olana&#x11F;&#x131; olmad&#x131;&#x11F;&#x131; gibi, mevcut durum &#xFC;zerinde de pek fazla kontrol&#xFC; bulunmaz. Belirli d&#xF6;nemlerde yap&#x131;lan maa&#x15F; zamlar&#x131; s&#xFC;reci de a&#x15F;a&#x11F;&#x131; yukar&#x131; ayn&#x131; &#x15F;ekilde devam eder.<br>Halbuki sahip oldu&#x11F;umuz yegane para kazama arac&#x131; olan i&#x15F; g&#xFC;c&#xFC;m&#xFC;z &#xFC;zerinde hak sahibi olamamak tuhaf de&#x11F;il mi? Yahut bu i&#x15F; g&#xFC;c&#xFC; &#xFC;zerinde de&#x11F;er belirleyici taraflardan biri olmaya &#xE7;al&#x131;&#x15F;mak neden e&#x11F;reti durur?<br>Neden zam d&#xF6;nemleri yaln&#x131;zca &#xE7;ok az &#x15F;irkette &#xE7;al&#x131;&#x15F;an ve i&#x15F; veren aras&#x131;nda bir pazarl&#x131;k s&#xFC;recine d&#xF6;n&#xFC;&#x15F;ebiliyor? Neden &#xE7;ok az &#x15F;irkette zam d&#xF6;nemleri &#xE7;al&#x131;&#x15F;an ve i&#x15F; verenin birbirleri hakk&#x131;nda planlar&#x131;n&#x131; ve vaatlerini payla&#x15F;abilecekleri bir diyalo&#x11F;a d&#xF6;n&#xFC;&#x15F;ebiliyor?<br>Bunlar&#x131; cevaplayarak konuyu daha fazla uzatmak istemiyorum.</p><p>T&#xFC;rkiye k&#x131;sm&#x131;n&#x131; burada bitirip as&#x131;l konumuz olan <strong>Almanya&apos;da bili&#x15F;imci olmak</strong> k&#x131;sm&#x131;na ge&#xE7;mek istiyorum. Ancak k&#x131;yas yapabilmek i&#xE7;in &#xF6;nce T&#xFC;rkiye&apos;de bili&#x15F;im sekt&#xF6;r&#xFC; hakk&#x131;ndaki fikirlerimi payla&#x15F;mam gerekiyordu.</p><h2 id="almanya-da-bili-imci-olmak">Almanya&apos;da bili&#x15F;imci olmak</h2><p>Almanya&apos;ya 2019&apos;un A&#x11F;ustos ay&#x131;nda ta&#x15F;&#x131;nd&#x131;m. A&#x15F;a&#x11F;&#x131; yukar&#x131; 1 y&#x131;l oldu diyebiliriz. Burada &#xE7;al&#x131;&#x15F;t&#x131;&#x11F;&#x131;m &#x15F;irketle asl&#x131;nda 2019&apos;un May&#x131;s ay&#x131;nda uzaktan &#xE7;al&#x131;&#x15F;maya ba&#x15F;lad&#x131;m. Vize s&#xFC;recimi beklerken de &#x15F;irketin &#xE7;al&#x131;&#x15F;ma &#x15F;eklini &#xF6;&#x11F;renmem i&#xE7;in g&#xFC;zel bir f&#x131;rsat oldu. Elbette Almanya&apos;n&#x131;n &#xE7;al&#x131;&#x15F;ma hayat&#x131;n&#x131; tan&#x131;d&#x131;&#x11F;&#x131;m&#x131; s&#xF6;yleyemem. Hen&#xFC;z &#xE7;ok az tecr&#xFC;bem var. Fakat s&#xF6;yleyecek &#x15F;eyler biriktirdim.</p><h3 id="almanya-da-beklentiler">Almanya&apos;da beklentiler</h3><p>T&#x131;pk&#x131; &#xFC;lkemizde oldu&#x11F;u gibi, Almanya&apos;da da &#xE7;al&#x131;&#x15F;alar&#x131;n, y&#xF6;neticilerin ve i&#x15F; verenlerin farkl&#x131; beklentileri var birbirlerinden. Fakat beklentiler son derece net bir &#x15F;ekilde ifade ediliyor. Bu beklentiler i&#xE7;in plan belirleniyor ve her taraf bekleneni kar&#x15F;&#x131;lamak i&#xE7;in gereken &#xE7;al&#x131;&#x15F;may&#x131; yap&#x131;yor. Bu noktada a&#xE7;&#x131;kta kalan hi&#xE7; bir madde olmuyor.<br>Zaman i&#xE7;erisinde geli&#x15F;en ihtiya&#xE7;lar&#x131;n&#x131;z ya da de&#x11F;i&#x15F;iklik istekleriniz olabilir elbette. Bunu basit bir &#xF6;rnekle anlatal&#x131;m.</p><ul><li>&#xC7;al&#x131;&#x15F;an: &quot;Yeni bir koltu&#x11F;a ihtiyac&#x131;m var, benimkinden memnun de&#x11F;ilim. Yenisini alabilir miyiz?&quot;</li><li>Y&#xF6;netici: &quot;Evet, yeni bir koltu&#x11F;u bir sonraki hafta Pazartesi g&#xFC;n&#xFC; sipari&#x15F; edebiliriz.&quot; Ya da</li><li>Y&#xF6;netici: &quot;Ar&#x131;zal&#x131; koltuklar d&#x131;&#x15F;&#x131;nda, &#xF6;n&#xFC;m&#xFC;zdeki y&#x131;la kadar mobilya sat&#x131;n almay&#x131; planlam&#x131;yoruz.&quot;</li></ul><p>G&#xF6;r&#xFC;ld&#xFC;&#x11F;&#xFC; &#xFC;zere diyalog gayet net.</p><p>&quot;Ben bunu bir konu&#x15F;ay&#x131;m.&quot;, &#xA0;&quot;&#x15E;u i&#x15F;i bir halledelim, sonra &#xE7;&#xF6;zeriz.&quot;, &quot;&#x130;&#x15F;i insan yapar, masa koltuk de&#x11F;il.&quot; Gibi anlams&#x131;z c&#xFC;mleler i&#x15F;itmezsiniz.</p><p>&#x130;&#x15F; m&#xFC;lakatlar&#x131;n&#x131;n bir evresinde, kesinlikle maa&#x15F;&#x131;n&#x131;z &#xFC;zerine bir oturum yap&#x131;l&#x131;r. Bu noktada e&#x11F;er talep etti&#x11F;iniz maa&#x15F; &#xF6;demek istediklerinden fazlaysa, &#xF6;demek istedikleri miktar&#x131; belirtip, bunun yan&#x131;nda size bir ek fayda paketi sunabilirler. Bunun i&#xE7;erisinde farkl&#x131; tipte sa&#x11F;l&#x131;k sigortalar&#x131;, y&#x131;ll&#x131;k tatil masraflar&#x131; i&#xE7;in bonuslar, elektrikli bisiklet ya da spor salonu aboneli&#x11F;i gibi bir&#xE7;ok &#x15F;ey olabilir.<br>Ayn&#x131; oturumda &#xF6;n&#xFC;n&#xFC;zdeki bir ka&#xE7; y&#x131;l&#x131;n gelir plan&#x131;n&#x131; dahi birlikte yapabilirsiniz. &#x130;lk y&#x131;l&#x131;n sonunda alaca&#x11F;&#x131;n&#x131;z zam oran&#x131; bir ka&#xE7; farkl&#x131; kalemde belirlenebilir. &#xD6;rne&#x11F;in projenizin ya da i&#x15F;inizin belli ba&#x15F;l&#x131; kilometre ta&#x15F;lar&#x131; i&#xE7;in farkl&#x131; maa&#x15F; zamlar&#x131; dahi g&#xF6;rebilirsiniz.<br>Almanya ve Hollanda &#x15F;irketleri ile i&#x15F; g&#xF6;r&#xFC;&#x15F;meleri yapt&#x131;m ve s&#xFC;re&#xE7;ler hemen hemen ayn&#x131; say&#x131;l&#x131;rd&#x131;. T&#x131;pk&#x131; bir i&#x15F; insan&#x131;n&#x131;n, &#x15F;irketindeki bir &#xFC;r&#xFC;n ya da hizmeti ba&#x15F;ka bir &#x15F;irkete satmaya &#xE7;al&#x131;&#x15F;t&#x131;&#x11F;&#x131; gibi adil ve e&#x15F;it bir pazarl&#x131;k s&#xFC;recinin i&#xE7;erisine giriyorsunuz.</p><p>Almanya&apos;da y&#xF6;neticiniz ile bir sorunu &#xE7;&#xF6;z&#xFC;me kavu&#x15F;turmak son derece kolayd&#x131;r. Elbette sonu&#xE7; hep istedi&#x11F;iniz gibi olmayacakt&#x131;r. Ancak s&#xFC;re&#xE7; nettir ve netice kal&#x131;c&#x131;d&#x131;r. Esnemez, gev&#x15F;emez.<br>&#x130;&#x15F; arkada&#x15F;lar&#x131;n&#x131;z&#x131;n, y&#xF6;neticilerinizin talepleri nettir. Anlams&#x131;z imalar, savsaklamalar ile yorulmazs&#x131;n&#x131;z.</p><h3 id="almanya-da-i-hayat-ve-zel-hayat-dengesi">Almanya&apos;da i&#x15F; hayat&#x131; ve &#xF6;zel hayat dengesi</h3><p>&#xD6;zel hayat&#x131;n&#x131;z kesinlikle i&#x15F; hayat&#x131;n&#x131;z&#x131;n &#xF6;n&#xFC;nde. Bu durum kanunlar ile korundu&#x11F;u gibi y&#xF6;netici ve i&#x15F; verenler de konuya son derece hassas yakla&#x15F;&#x131;yorlar. Her ne kritere ba&#x11F;l&#x131; &#xE7;al&#x131;&#x15F;&#x131;yor olursan&#x131;z olun(mesai saati, g&#xF6;revlendirme v.b) g&#xFC;nl&#xFC;k &#xE7;al&#x131;&#x15F;ma kriterinizi tamamlad&#x131;&#x11F;&#x131;n&#x131;zda i&#x15F;iniz bitmi&#x15F; demektir. &#xC7;antan&#x131;z&#x131; al&#x131;p gidersiniz.</p><p>Zaman zaman elbette fazla mesai yapman&#x131;z gerekebilir. Ancak bu durumun &#xFC;st s&#x131;n&#x131;rlar&#x131;n&#x131;, fazla mesai neticesinde edinece&#x11F;iniz faydalar&#x131; daha i&#x15F;in ba&#x15F;&#x131;nda s&#xF6;zle&#x15F;menizde g&#xF6;r&#xFC;rs&#xFC;n&#xFC;z. Bu maddeler sizin takip etmenize gerek kalmadan uygulan&#x131;r. Edinece&#x11F;iniz faydalar her ne ise, belirlenen zamanda elinize ula&#x15F;&#x131;r.<br>Fazladan &#xE7;al&#x131;&#x15F;ma s&#xFC;reci de genellikle 1 hafta &#xF6;nceden belirlenir ve sizin onay&#x131;n&#x131;z istenir. E&#x11F;er uygun de&#x11F;ilseniz yeni bir planlama talep edebilme &#xF6;zg&#xFC;rl&#xFC;&#x11F;&#xFC;n&#xFC;z de bulunur. Elbette bu durum &#x15F;irketten &#x15F;irkete k&#xFC;&#xE7;&#xFC;k farkl&#x131;l&#x131;klar g&#xF6;sterecektir.</p><p>Fazla mesai d&#x131;&#x15F;&#x131;nda kalan t&#xFC;m g&#xF6;revlerinizde de tam s&#xF6;z hakk&#x131; sahibisiniz. &#xC7;&#xFC;nk&#xFC; burada uzman sizsiniz ve sizin uzmanl&#x131;&#x11F;&#x131;n&#x131;za sayg&#x131; duyulur. Bahsi ge&#xE7;en i&#x15F;in yap&#x131;laca&#x11F;&#x131; s&#xFC;reyi de&#x11F;i&#x15F;tirmeyi tart&#x131;&#x15F;maya a&#xE7;abilirsiniz. &#x130;&#x15F;in yap&#x131;lma &#x15F;eklini ve kabul kriterlerini de. K&#x131;sacas&#x131; i&#x15F;in her noktas&#x131;nda fikir beyan edebilirsiniz. Beyan etti&#x11F;iniz fikirlerin ne kadar dikkatle ele al&#x131;nd&#x131;&#x11F;&#x131;na inanmakta ilk ba&#x15F;larda zorlanabilirsiniz.<br>&#xD6;zel hayat&#x131;n&#x131;z size aittir ve bundan feragat etmenizi bekleme haklar&#x131;n&#x131;n olmad&#x131;&#x11F;&#x131; bilinciyle sizinle ileti&#x15F;im kurulur. Kar&#x15F;&#x131;l&#x131;&#x11F;&#x131;nda bir fayda sa&#x11F;layacak olman&#x131;za ra&#x11F;men, fazla mesai durumunu kabul etmeniz, y&#xF6;neticileriniz taraf&#x131;ndan k&#x131;ymetli bir &#xF6;zveri olarak de&#x11F;erlendirilecektir.<br>&#x130;&#x15F;te tam bu bilin&#xE7; nedeniyle, Almanya&apos;da &#xE7;al&#x131;&#x15F;t&#x131;&#x11F;&#x131;m a&#x15F;a&#x11F;&#x131; yukar&#x131; 1 y&#x131;ll&#x131;k s&#xFC;re&#xE7;te, toplam fazla mesaim 2 ya da 3 saati ge&#xE7;memi&#x15F;tir. T&#xFC;rkiye tecr&#xFC;bemde ise her &#xE7;al&#x131;&#x15F;ma haftas&#x131;n&#x131;n en az 3 g&#xFC;n&#xFC;n&#xFC;n fazla mesai ile ge&#xE7;ti&#x11F;ini &#xFC;z&#xFC;lerek hat&#x131;rl&#x131;yorum.</p><p>Almanya&apos;da genellikle 30 i&#x15F; g&#xFC;n&#xFC; y&#x131;ll&#x131;k izne sahip olursunuz. Bu 30 i&#x15F; g&#xFC;n&#xFC;ne hafta sonunun herhangi bir g&#xFC;n&#xFC; dahil edilmez. Yani dolu dolu koca 6 hafta tatile &#xE7;&#x131;kabilirsiniz her y&#x131;l. Baz&#x131; &#x15F;irketlerin bu tatilleri en fazla &#xA0;3&apos;er hafta olarak 2&apos;ye b&#xF6;l&#xFC;nmesini istedi&#x11F;ini biliyorum. Elbette isterseniz daha k&#xFC;&#xE7;&#xFC;k par&#xE7;alar olarak da kullanabilrisiniz. Tabi bu durum siz i&#x15F;e daha ba&#x15F;lamadan s&#xF6;zle&#x15F;menizde ya da &#x15F;irketinizin tan&#x131;t&#x131;m d&#xF6;k&#xFC;manlar&#x131;nda size belirtilir. Y&#x131;ll&#x131;k izin tarihlerinize herhangi bir resmi tatil denk geliyorsa &#x15F;ansl&#x131;s&#x131;n&#x131;z. O g&#xFC;nler y&#x131;ll&#x131;k izninizden d&#xFC;&#x15F;&#xFC;lmeyecektir. &#xD6;te yandan herhangi bir resmi tatil ile y&#x131;ll&#x131;k izninizin birka&#xE7; g&#xFC;n&#xFC;n&#xFC; birle&#x15F;tirmenizde hi&#xE7; bir sak&#x131;nca yoktur.</p><p>Ben Almanya&apos;da ya&#x15F;amaya yeniden ba&#x15F;lad&#x131;&#x11F;&#x131;m&#x131; hissediyorum. Mesai bittikten sonra pikni&#x11F;e gidebilecek vaktim oluyor. Bisikletlerimize atlay&#x131;p do&#x11F;ada saatler ge&#xE7;irebiliyoruz. Bunu yapmak i&#xE7;in vaktimizin kalmas&#x131; bir yana, o g&#xFC;n i&#x15F;imin bitti&#x11F;ini ve kimsenin beni rahats&#x131;z etmeyece&#x11F;ini biliyorum. Bunun i&#xE7;sel rahatl&#x131;&#x11F;&#x131;n&#x131; tarif etmeyi denedim ama edemiyorum.</p><h3 id="almanya-da-cretlerin-belirlenme-s-reci">Almanya&apos;da &#xFC;cretlerin belirlenme s&#xFC;reci</h3><p>Daha &#xF6;nce de s&#xF6;yledi&#x11F;im gibi. Bu s&#xFC;re&#xE7; hem Almanya hem de Hollanda i&#xE7;in hemen hemen ayn&#x131;yd&#x131; benim tecr&#xFC;belerime g&#xF6;re. &#x130;&#x15F; g&#xF6;r&#xFC;&#x15F;mesi s&#xFC;recinin bir oturumu olarak de&#x11F;erlendiriliyor &#xFC;cretin belirlenme s&#xFC;reci. Genel olarak son a&#x15F;amada yap&#x131;lan bir oturum olmas&#x131;n&#x131;n yan&#x131;nda, en &#xE7;ok haz&#x131;rlan&#x131;lmas&#x131; gereken oturum oldu&#x11F;unu d&#xFC;&#x15F;&#xFC;n&#xFC;yorum.<br>Almanya&apos;da maa&#x15F;lar y&#x131;ll&#x131;k br&#xFC;t olarak sunulur. Bu maa&#x15F; teklifini hesaplamak i&#xE7;in bir &#xE7;ok ara&#xE7; bulunuyor. En pop&#xFC;lerlerden birtanesine <a href="https://www.brutto-netto-rechner.info/gehalt/gross_net_calculator_germany.php?ref=localhost">buradan</a> ula&#x15F;&#x131;labilir.<br>Bu oturumda e&#x15F;it iki taraf olarak yeteneklerinizin maddi de&#x11F;erini belirlersiniz. Yaln&#x131;zca maa&#x15F; teklifi sunulmaz, co&#x11F;u zaman size sa&#x11F;lanacak yan haklar da sunulur. Bu adaydan adaya de&#x11F;i&#x15F;iklik g&#xF6;sterir. Daha de&#x11F;erli g&#xF6;r&#xFC;len adaya daha fazla yan fayda teklif edilebilir. Bu noktada de&#x11F;erinizi iyi bilmeli ve kendinizi iyi tan&#x131;tabilmelisiniz.<br>Ayr&#x131;ca ileriye d&#xF6;n&#xFC;k anla&#x15F;malar da bu oturumda yap&#x131;labilir. &#xD6;rne&#x11F;in &#xF6;n&#xFC;n&#xFC;zdeki 3 y&#x131;l&#x131;n gelir plan&#x131; size yine tart&#x131;&#x15F;&#x131;labilir ko&#x15F;ullar kar&#x15F;&#x131;l&#x131;&#x11F;&#x131;nda sunulabilir.<br>Bunu yine &#xF6;rnek bir diyalog ile somutla&#x15F;t&#x131;ral&#x131;m.</p><p>Bardak &#xFC;retmek &#xFC;zerine bir i&#x15F; yapt&#x131;&#x11F;&#x131;n&#x131;z&#x131; d&#xFC;&#x15F;&#xFC;nelim.</p><ul><li>&#x15E;irket temsilcisi: &quot;&#xD6;n&#xFC;m&#xFC;zdeki 12 ay boyunca size 50.000 Euro teklif ediyoruz. 13. ay ise y&#x131;ll&#x131;k &#xFC;cretinizde %5&apos;lik bir art&#x131;&#x15F; yapaca&#x11F;&#x131;z.&quot;</li><li>Aday: &quot;12 ayl&#x131;k teklifiniz uygundur. Fakat 12 ay&#x131;n sonunda yaln&#x131;zca bardak de&#x11F;il, ayn&#x131; zamanda kupa da &#xFC;retebilece&#x11F;imden eminim. Bu nedenle 13. ay art&#x131;&#x15F;&#x131;n&#x131;n %8 olmas&#x131; benim a&#xE7;&#x131;mdan daha uygun.&quot;</li><li>&#x15E;irket temsilcisi: &quot;Bu hedefe ula&#x15F;t&#x131;&#x11F;&#x131;n&#x131;z takdirde %8&apos;i kabul ediyoruz. Aksi halde %5&apos;lik art&#x131;&#x15F;ta anla&#x15F;mal&#x131;y&#x131;z.&quot;</li></ul><p>Bu &#xF6;rnek konu&#x15F;ma, hi&#xE7; &#x15F;&#xFC;pheniz olmas&#x131;n s&#xF6;zle&#x15F;menizde maddele&#x15F;tirilip size sunulacakt&#x131;r. Hedefinizi yakalad&#x131;&#x11F;&#x131;n&#x131;zda da kimseye gidip bunu beyan etmenize gerek kalmadan s&#xF6;z verilen oranda art&#x131;&#x15F;&#x131;n&#x131;z yap&#x131;lacakt&#x131;r.<br>Bu tip anla&#x15F;malar&#x131;, y&#x131;ll&#x131;k d&#xF6;nemlerle s&#xFC;rekli yineleyebilece&#x11F;iniz i&#x15F; ortamlar&#x131; bulmak hi&#xE7; de zor de&#x11F;ildir. G&#xF6;rd&#xFC;&#x11F;&#xFC;n&#xFC;z gibi siz bir birey olarak kendinizi rahatl&#x131;kla temsil edebilir ve eme&#x11F;inizin ederi &#xFC;zerinde &#xF6;zg&#xFC;rce konu&#x15F;abilirsiniz.</p><p>Bu yaz&#x131;y&#x131; daha fazla uzatmadan neticeye ba&#x11F;lamak isterim. Ben 36 ya&#x15F;&#x131;nda ya&#x15F;ad&#x131;&#x11F;&#x131; &#xFC;lkeyi de&#x11F;i&#x15F;tirmi&#x15F; biriyim. Ya&#x15F;&#x131;n&#x131;z&#x131;n hi&#xE7; &#xF6;nemi yok ve asla de&#x11F;i&#x15F;iklik yapmak i&#xE7;in ge&#xE7; de&#x11F;il.<br>Almanya ile ilgili yaz&#x131;lar&#x131;m devam edecek, bu yaz&#x131;lara y&#xF6;n vermek ve katk&#x131;ta bulunmak i&#xE7;in a&#x15F;a&#x11F;&#x131;daki yorum b&#xF6;l&#xFC;m&#xFC;n&#xFC; kullanmaktan &#xE7;ekinmeyin l&#xFC;tfen.</p>]]></content:encoded></item><item><title><![CDATA[Neuschwanstein Şatosu]]></title><description><![CDATA[Almanya'da haftasonlarını değerlendirmek için Bayern Ticket alıp Bavyera'yı geziyoruz. Muhteşem bir doğa ve çok etkileyici bir şato Neuschwanstein.]]></description><link>https://www.gokhangeyik.net/neuschwanstein-satosu/</link><guid isPermaLink="false">5ff2320f8fbbf80001f8ee05</guid><category><![CDATA[Hayat]]></category><category><![CDATA[Almanya]]></category><category><![CDATA[Gezi]]></category><dc:creator><![CDATA[Gökhan Geyik]]></dc:creator><pubDate>Tue, 14 Jul 2020 20:08:00 GMT</pubDate><media:content url="https://www.gokhangeyik.net/content/images/2021/01/castle-landscape.jpg" medium="image"/><content:encoded><![CDATA[<img src="https://www.gokhangeyik.net/content/images/2021/01/castle-landscape.jpg" alt="Neuschwanstein &#x15E;atosu"><p>Almanya&apos;da haftasonlar&#x131;n&#x131; de&#x11F;erlendirmek i&#xE7;in Bayern Ticket al&#x131;p Bavyera&apos;y&#x131; geziyoruz. Muhte&#x15F;em bir do&#x11F;a ve &#xE7;ok etkileyici bir &#x15F;ato.</p><p>Ludwig II of Bavaria, in&#x15F;aata merak&#x131;yla bilinen bir kralm&#x131;&#x15F;. Ancak bu &#x15F;ato yapt&#x131;rd&#x131;&#x11F;&#x131; en ihti&#x15F;aml&#x131;s&#x131;. Gezilerimizi takip etmeyi unutmay&#x131;n.</p><figure class="kg-card kg-embed-card"><iframe width="356" height="200" src="https://www.youtube.com/embed/2Wtgr2kT0BU?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe></figure>]]></content:encoded></item><item><title><![CDATA[Cron Nedir]]></title><description><![CDATA[Cron servisinin en küçük zaman aralığı 1 dakikadır. Yani tekrar eden işlemleri en kısa 1 dakikalık aralıklarla çalıştırabilir. Fakat bu yazıda, 1 dakikadan kısa sürelerde işlemleri nasıl çalıştırabileceğimizi de göreceğiz.]]></description><link>https://www.gokhangeyik.net/cron-nedir/</link><guid isPermaLink="false">5ff22c5934e2940001e64125</guid><category><![CDATA[Linux]]></category><category><![CDATA[Cron]]></category><category><![CDATA[Crontab]]></category><category><![CDATA[OS]]></category><dc:creator><![CDATA[Gökhan Geyik]]></dc:creator><pubDate>Wed, 03 May 2017 19:45:00 GMT</pubDate><media:content url="https://www.gokhangeyik.net/content/images/2021/01/Old-Man-Holding-A-Clock.jpg" medium="image"/><content:encoded><![CDATA[<img src="https://www.gokhangeyik.net/content/images/2021/01/Old-Man-Holding-A-Clock.jpg" alt="Cron Nedir"><p>UNIX tipi i&#x15F;letim sistemlerinde zamanlanm&#x131;&#x15F; g&#xF6;revler i&#xE7;in cron kullan&#x131;l&#x131;r. Bu daemon &#xE7;ok k&#xFC;&#xE7;&#xFC;k farkl&#x131;l&#x131;klar ile t&#xFC;m UNIX tipi sistemler i&#xE7;erisinde bulunur. Cron ismini <a href="http://en.wikipedia.org/wiki/Chronos?target=_blank&amp;ref=localhost">Chronos</a>&apos;tan alm&#x131;&#x15F;t&#x131;r.</p><p>UNIX&apos;lerde bu tip al&#x131;nt&#x131;lara &#xE7;ok&#xE7;a rastlan&#x131;r. Zaman temelli bir daemon olan cron i&#xE7;in olduk&#xE7;a uygun bir isim. Cron servisinin en k&#xFC;&#xE7;&#xFC;k zaman aral&#x131;&#x11F;&#x131; 1 dakikad&#x131;r. Yani tekrar eden i&#x15F;lemleri en k&#x131;sa 1 dakikal&#x131;k aral&#x131;klarla &#xE7;al&#x131;&#x15F;t&#x131;rabilir. Fakat bu yaz&#x131;da, 1 dakikadan k&#x131;sa s&#xFC;relerde i&#x15F;lemleri nas&#x131;l &#xE7;al&#x131;&#x15F;t&#x131;rabilece&#x11F;imizi de g&#xF6;rece&#x11F;iz.</p><h2 id="crontab">Crontab</h2><p>Cron servisi crontab(Cron Table) ile i&#x15F;letilir. &#xC7;ok karma&#x15F;&#x131;k olmayan bir ifade dizgisine sahiptir.<br>Sistem &#xE7;ap&#x131;nda bir crontab dosyas&#x131; genellikle /etc alt&#x131;nda bulunur ve root eri&#x15F;imi ile m&#xFC;dahale edilebilir. Ancak bununla birlikte di&#x11F;er kullan&#x131;c&#x131;lar da kendi crontab dosyalar&#x131;n&#x131; olu&#x15F;turabilirler. Bu dosya i&#xE7;erisindeki her bir sat&#x131;r, bir g&#xF6;rev veya komut anlam&#x131;n&#x131; ta&#x15F;&#x131;maktad&#x131;r.</p><p>&#xD6;rnek bir crontab sat&#x131;r&#x131; &#x15F;&#xF6;yle olabilir;</p><pre><code class="language-plaintext">*/1 * * * * /usr/scripts/test.sh &gt; /dev/null 2&gt;&amp;1
</code></pre><p>Yukar&#x131;daki dizgi test.sh ismindeki shell scrpiti her 60 saniyede yani her 1 dakikada cal&#x131;&#x15F;t&#x131;racakt&#x131;r.</p><p>Bu sat&#x131;r&#x131; daha iyi anlamak i&#xE7;in a&#x15F;a&#x11F;&#x131;daki tabloya g&#xF6;z at&#x131;n. Sat&#x131;r sonunda g&#xF6;r&#xFC;len <code>&gt; /dev/null 2&gt;&amp;1</code> ifadesini ve a&#xE7;&#x131;klamas&#x131;n&#x131; yaz&#x131;n&#x131;n ilerleyen sat&#x131;rlar&#x131;nda bulabilirsiniz.</p><pre><code class="language-plaintext">* * * * * /yol/komut arguman 
&#x252C; &#x252C; &#x252C; &#x252C; &#x252C; 
&#x2502; &#x2502; &#x2502; &#x2502; &#x2502; 
&#x2502; &#x2502; &#x2502; &#x2502; &#x2502; 
&#x2502; &#x2502; &#x2502; &#x2502; &#x2514;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500; Haftan&#x131;n G&#xFC;n&#xFC;. (0 = Pazar) 
&#x2502; &#x2502; &#x2502; &#x2514;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500; Ay (1-12) 
&#x2502; &#x2502; &#x2514;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500; Ay&#x131;n G&#xFC;n&#xFC; (1 - 31) 
&#x2502; &#x2514;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500; Saat (0 - 23) 
&#x2514;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500;&#x2500; Dakika (0 - 59)
</code></pre><p>Her sat&#x131;r&#x131;n ba&#x15F;&#x131;nda bulunan <code>#</code> ifadesini g&#xF6;rmezden gelin. Zaten a&#x15F;a&#x11F;&#x131; yukar&#x131; i&#x15F;levi bu. Ba&#x15F;&#x131;nda bulundu&#x11F;u her ifadenin bir yorum oldu&#x11F;u ve i&#x15F;lenmemesi gerekti&#x11F;ini ifade ediyor.</p><p>!!! Crontab i&#xE7;erisinde pasif hale getirmek istedi&#x11F;iniz bir g&#xF6;revin ilk sat&#x131;r&#x131;na <code>#</code> koyman&#x131;z yeterli</p><p>&#x130;lk &#xF6;rnekte oldu&#x11F;u gibi cron ifadeleri i&#xE7;erisinde birtak&#x131;m operat&#xF6;rler kullanabiliriz. Bu operat&#xF6;rlerden baz&#x131;lar&#x131; gruplanm&#x131;&#x15F; halde modern UNIX tipi sistemlerde bulunabilirler. Cron bir&#xE7;ok farkl&#x131; &#x15F;ekilde t&#xFC;remi&#x15F;tir. Anacron, dcron ve fcron bunlardan birka&#xE7;&#x131;d&#x131;r. Bu operat&#xF6;rlerin bir k&#x131;sm&#x131; kulland&#x131;&#x11F;&#x131;n&#x131;z cron t&#xFC;revinde bulunmayabilir. Ancak elimden geldi&#x11F;ince genel ge&#xE7;er anlatmaya &#xE7;al&#x131;&#x15F;aca&#x11F;&#x131;m.</p><h2 id="cron-operat-rler">Cron Operat&#xF6;rler</h2><h3 id="asterisk-">Asterisk ( * )</h3><p>Asterisk operat&#xF6;r&#xFC; bulundu&#x11F;u kolonun her ald&#x131;&#x11F;&#x131; de&#x11F;eri kapsar. Yani E&#x11F;er haftan&#x131;n her g&#xFC;n&#xFC;n&#xFC; ifade etmek istiyorsan&#x131;z, 5. kolona tek tek hafta g&#xFC;nlerini yazmak yerine <code>*</code> kullanabilirsiniz.</p><p><strong>&#xD6;rnek:</strong></p><pre><code class="language-plaintext">* * * * * /usr/scripts/test.sh &gt; /dev/null 2&gt;&amp;1
</code></pre><p>Yukar&#x131;daki &#xF6;rnekte ifade asl&#x131;nda her dakika &#xE7;al&#x131;&#x15F;acak &#x15F;ekildedir. &#xC7;&#xFC;nk&#xFC; cron cycle 60 saniyede bir &#xE7;al&#x131;&#x15F;&#x131;r.</p><h3 id="tire-">Tire ( - )</h3><p>Bu operat&#xF6;r bir de&#x11F;er aral&#x131;&#x11F;&#x131; belirtmek i&#xE7;in kullan&#x131;l&#x131;r. Her saatin 10. dakikas&#x131;ndan 20. dakikas&#x131;na kadar bir i&#x15F;leme ihtiyac&#x131;n&#x131;z olabilir.</p><p><strong>&#xD6;rnek:</strong></p><pre><code class="language-plaintext">10-20 * * * * /usr/scripts/test.sh &gt; /dev/null 2&gt;&amp;1
</code></pre><h3 id="virg-l-">Virg&#xFC;l ( , )</h3><p>Bu operat&#xF6;r t&#x131;pk&#x131; <code>AND</code> kap&#x131;s&#x131; veya bir&#xE7;ok <code>C</code> k&#xF6;kenli dildeki <code>&amp;&amp;</code> operat&#xF6;r&#xFC;ne denk gelir. Her saatin 10. ve 20. dakikas&#x131;n&#x131; ifade edebiliriz.</p><p><strong>&#xD6;rnek:</strong>*</p><pre><code class="language-plaintext">10,20 * * * * /usr/scripts/test.sh &gt; /dev/null 2&gt;&amp;1
</code></pre><h3 id="slash-">Slash ( / )</h3><p>Kelimelerle ifade etmenin biraz kafa kar&#x131;&#x15F;t&#x131;r&#x131;c&#x131; oldu&#x11F;u bir operat&#xF6;r. Daha &#xF6;nce her saatin 10. dakikas&#x131;ndan 20. dakikas&#x131;na kadar &#xE7;al&#x131;&#x15F;an bir ifade yazm&#x131;&#x15F;t&#x131;k. Cron her 60 saniyede bir tetiklendi&#x11F;i i&#xE7;in ifademizin bu zaman aral&#x131;&#x11F;&#x131;nda her dakikada bir &#xE7;al&#x131;&#x15F;aca&#x11F;&#x131;n&#x131; biliyorduk. Peki her 2 dakikada bir &#xE7;al&#x131;&#x15F;mas&#x131;n&#x131; istiyorsak?</p><p><strong>&#xD6;rnek:</strong></p><pre><code class="language-plaintext">10-20/2 * * * * /usr/scripts/test.sh &gt; /dev/null 2&gt;&amp;1
</code></pre><p>Bu operat&#xF6;rlerin yan&#x131;nda, baz&#x131; &#xF6;nceden belirlenmi&#x15F; ifadelerde s&#xF6;z konusudur. Bu ifadeleri fazla detayland&#x131;rmadan bir tablo halinde g&#xF6;stermek daha iyi olacakt&#x131;r.</p><h2 id="-kt-kontrol-">&#xC7;&#x131;kt&#x131; Kontrol&#xFC;</h2><p>Cron ifadelerimiz &#xE7;al&#x131;&#x15F;&#x131;rken, m&#xFC;mk&#xFC;n oldu&#x11F;unca &#xE7;&#x131;kt&#x131; vermemeleri iyidir. &#xC7;&#xFC;nk&#xFC; bu &#xE7;&#x131;kt&#x131; tipine g&#xF6;re <code>stdout</code> veya <code>stderr</code> streamlerine gidecektir. Bu streamleri baz&#x131; sistemler e-posta ile(ki &#xE7;o&#x11F;unlukla local-delivery) ula&#x15F;t&#x131;rmaya &#xE7;al&#x131;&#x15F;&#x131;r. Cron scriptlerimizin yahut komutlar&#x131;m&#x131;z&#x131;n do&#x11F;ru &#xE7;al&#x131;&#x15F;t&#x131;&#x11F;&#x131;ndan emin olup bu gereksiz &#xE7;&#x131;kt&#x131;lar&#x131; engellemek en do&#x11F;ru harekettir.</p><p>UNIX tipi ve bir&#xE7;ok di&#x11F;er i&#x15F;letim sisteminde <code>&gt;</code> operat&#xF6;r&#xFC; &#xE7;&#x131;kt&#x131; y&#xF6;nlendirmek i&#xE7;in kullan&#x131;l&#x131;r.</p><p><strong>&#xD6;rnek:</strong></p><pre><code class="language-bash">echo &quot;Kodzilla&quot; &gt; kodzilla.txt
</code></pre><p>Yukar&#x131;daki &#xF6;rnekte eksik bir ifadeyle ekrana, do&#x11F;ru bir ifadeyle stdout&apos;a Kodzilla stringini g&#xF6;nderiyoruz. &#xC7;&#xFC;nk&#xFC; <code>echo</code> tam olarak bunu yapar. Ancak bu &#xE7;&#x131;kt&#x131;y&#x131; <code>&gt;</code> operat&#xF6;r&#xFC; ile kodzilla.txt dosyas&#x131;na y&#xF6;nlendirdik.</p><p>Baz&#x131; &#xF6;zel ifadeler yard&#x131;m&#x131;yla, <code>stdout</code> ve <code>stderr</code> kontrole sahip olmad&#x131;&#x11F;&#x131;m&#x131;z zamanlarda ve &#xF6;ng&#xF6;remedi&#x11F;imiz &#xE7;&#x131;kt&#x131;lar&#x131; elimine edebilir ve <code>/dev/null</code> &#xA0;ayg&#x131;t&#x131;na y&#xF6;nlendirebiliriz. <code>/dev/null</code> UNIX tipi ve bir&#xE7;ok farkl&#x131; i&#x15F;letim sisteminde bulunur. Kara delik veya dibi olmayan &#xE7;&#xF6;p kovas&#x131; gibi isimleri vard&#x131;r.</p><p>File descriptorlar bu yaz&#x131;n&#x131;n konusu olmad&#x131;&#x11F;&#x131; i&#xE7;in detaylar&#x131;na girmeden ge&#xE7;ece&#x11F;im. Burada kulland&#x131;&#x11F;&#x131;m&#x131;z iki farkl&#x131; file descriptor var. 2, <code>stderr</code> anlam&#x131;na gelir. 1 ise <code>stdout</code>. Yaz&#x131;n&#x131;n ba&#x15F;&#x131;ndaki ilk &#xF6;rne&#x11F;e tekrar bakal&#x131;m.</p><pre><code class="language-plaintext">*/1 * * * * /usr/scripts/test.sh &gt; /dev/null 2&gt;&amp;1
</code></pre><p><code>2&gt;</code> ifadesi ile stderr <code>1</code>&apos;e yani <code>stdout</code>a y&#xF6;nlendirilmi&#x15F;. Sonraki <code>&gt;</code> operat&#xF6;r&#xFC; ile stdout <code>/dev/null</code> ayg&#x131;t&#x131;na y&#xF6;nlendirilmi&#x15F;. B&#xF6;ylelikle scrpitimizin tamamen sessizlik i&#xE7;erisinde &#xE7;al&#x131;&#x15F;mas&#x131;n&#x131; sa&#x11F;l&#x131;yoruz.</p><h2 id="cron-ve-saniyeler">Cron ve Saniyeler</h2><p>Art&#x131;k bildi&#x11F;iniz &#xFC;zere, cron saniyeler de&#x11F;il dakikalar baz&#x131;nda &#xE7;al&#x131;&#x15F;&#x131;yor. Yani saniyeler gereken i&#x15F;lerinizde sizi yaln&#x131;z b&#x131;rakacakt&#x131;r. Cron hakk&#x131;nda en &#xE7;ok sorulan sorulardan biri 1 dakikadan daha k&#x131;sa zaman dilimlerinde &#xE7;al&#x131;&#x15F;t&#x131;r&#x131;l&#x131;p &#xE7;al&#x131;&#x15F;t&#x131;r&#x131;lamayaca&#x11F;&#x131;d&#x131;r.</p><p>Hay&#x131;r. Cron dakikada bir tetiklenebilir. Ancak &#xE7;&#xF6;z&#xFC;ms&#xFC;z de&#x11F;il.</p><p>Bunu bir senaryo ile &#xF6;rneklendirerek yapal&#x131;m. Kullan&#x131;c&#x131;lar&#x131;m&#x131;z&#x131;n d&#xF6;n&#xFC;&#x15F;lerini ald&#x131;&#x11F;&#x131;m&#x131;z bir veri taban&#x131;m&#x131;z var. Bu veri taban&#x131;ndaki t&#xFC;m veriler bir cron i&#x15F;lemi taraf&#x131;ndan dakikada bir kontrol ediliyor ve yeni gelen kay&#x131;tlar elimize e-posta &#x15F;eklinde ula&#x15F;&#x131;yor. Ancak bu s&#xFC;reyi 30 saniyeye indirmek istiyoruz.</p><p>Cron&apos;un 60 saniyede bir tetiklenece&#x11F;i ger&#xE7;e&#x11F;ini g&#xF6;z &#xF6;n&#xFC;nde bulundurarak, istedi&#x11F;imiz i&#x15F;lemi &#xE7;al&#x131;&#x15F;t&#x131;r&#x131;ld&#x131;&#x11F;&#x131; anda bir kez yap&#x131;p 30 saniye uyuyan ve i&#x15F;lemi tekrar yapan sonra kendin sonland&#x131;ran bir script i&#x15F;imize yarayacakt&#x131;r.</p><h3 id="crontab-sat-r-">Crontab sat&#x131;r&#x131;</h3><pre><code class="language-plaintext">*/1 * * * * /usr/scripts/test.sh &gt; /dev/null 2&gt;&amp;1
</code></pre><p><strong>test.sh</strong></p><pre><code class="language-bash">#!/bin/bash
echo &quot;Mesaj Icerigi&quot; | mail -s &quot;Mesaj Basligi&quot; eposta@adresi
sleep 30
echo &quot;Mesaj Icerigi&quot; | mail -s &quot;Mesaj Basligi&quot; eposta@adresi
</code></pre><p>Bu zaman&#x131; daha k&#x131;saltabilir veya uzatabiliriz elbette. Ancak dikkat edilmesi gereken shell scrpitin i&#x15F;ini ne kadar s&#xFC;rede bitirdi&#x11F;idir. Bu zamanlamay&#x131; aksatabilecek en &#xF6;nemli de&#x11F;i&#x15F;kendir.</p><p>G&#xFC;ncel olarak &#xE7;ok kullan&#x131;lm&#x131;yor olsa da <code>cron.allow</code> ve <code>cron.deny</code> dosyalar&#x131; da mevcuttur. &#x130;simlerinden anla&#x15F;&#x131;laca&#x11F;&#x131; &#xFC;zere bu dosyalar ile sistem y&#xF6;neticisi baz&#x131; kullan&#x131;c&#x131;lar i&#xE7;in izin verebilir veya izin vermeyebilir. Fakat g&#xFC;ncel olarak pek kullan&#x131;ld&#x131;&#x11F;&#x131;na tan&#x131;k olmad&#x131;m.</p>]]></content:encoded></item><item><title><![CDATA[Default Route Değiştirici]]></title><description><![CDATA[Bazen tuhaf tuhaf işlere ihtiyaç duyuyorum. Bu script de onlardan bir tanesi. Yaptığı iş son derece basit. Belki bunu yapamanın daha doğru bir yolu vardır ama aramak için vakit bulamadım ve bu scripti yazdım.]]></description><link>https://www.gokhangeyik.net/default-route-degistirici/</link><guid isPermaLink="false">5ff234718fbbf80001f8ee26</guid><category><![CDATA[Python]]></category><category><![CDATA[Linux]]></category><category><![CDATA[Coding]]></category><dc:creator><![CDATA[Gökhan Geyik]]></dc:creator><pubDate>Fri, 17 Feb 2017 08:25:00 GMT</pubDate><media:content url="https://www.gokhangeyik.net/content/images/2021/01/asphalt-curly-road.jpg" medium="image"/><content:encoded><![CDATA[<img src="https://www.gokhangeyik.net/content/images/2021/01/asphalt-curly-road.jpg" alt="Default Route De&#x11F;i&#x15F;tirici"><p>Bazen tuhaf tuhaf i&#x15F;lere ihtiya&#xE7; duyuyorum. Bu script de onlardan bir tanesi. Yapt&#x131;&#x11F;&#x131; i&#x15F; son derece basit. Belki bunu yapaman&#x131;n daha do&#x11F;ru bir yolu vard&#x131;r ama aramak i&#xE7;in vakit bulamad&#x131;m ve bu scripti yazd&#x131;m.</p><p>&#x130;ki farkl&#x131; router mevcut ve biri ortadan kaybolursa sunucunun di&#x11F;eri ile devam etmesi gereklili&#x11F;i ortaya &#xE7;&#x131;kt&#x131;. A&#x15F;a&#x11F;&#x131;daki script Ubuntu 16.04 &#xFC;zerinde &#xE7;al&#x131;&#x15F;&#x131;yor ve herhangi bir problem &#xE7;&#x131;karmad&#x131;. Bir cron ile &#xE7;al&#x131;&#x15F;t&#x131;rabilirsiniz.</p><pre><code class="language-python">import os
import subprocess
import re

def pingGW (gw):
	try:
		output = subprocess.check_output(&quot;ping -c 3 &quot;+gw, shell=True)
	except Exception, e:
		return False
	return True
def findIP (routing_table, ip):
	result = re.findall(&apos;\\b&apos;+ip+&apos;\\b&apos;, routing_table, flags=re.IGNORECASE)
	if len(result) &gt; 0:
		return True
	else:
		return False

# Check maingw
maingw = &quot;172.22.25.1&quot;
maingw_response = pingGW(maingw)

# Check backupgw
backupgw = &quot;172.22.25.2&quot;
backupgw_response = pingGW(backupgw)

# Fetch routing table
route_table = os.popen(&quot;/sbin/ip route show&quot;).read()

# If maingw is down and backupgw is up, switch to backupgw
if (maingw_response == False ) and (backupgw_response == True):
	# Switch to backupgw
	if findIP(route_table,backupgw) == False:
		os.system(&quot;/sbin/ip route del default&quot;)
		os.system(&quot;/sbin/ip route add default via %s&quot; % backupgw)
if maingw_response == True:
	# Switch to maingw
        if findIP(route_table,maingw) == False:
		os.system(&quot;/sbin/ip route del default&quot;)
		os.system(&quot;/sbin/ip route add default via %s&quot; % maingw)
</code></pre>]]></content:encoded></item><item><title><![CDATA[Neden Ubuntu Kullanıyorum]]></title><description><![CDATA[Bu konuda yazılmış binlerce makale olduğu aşikar. Ancak herkesin kendince bir nedeni olduğu da ortada. Bu nedenle hemen hemen tüm projelerde Ubuntu kullanmamın nedenini anlatmaya karar verdim.
]]></description><link>https://www.gokhangeyik.net/neden-ubuntu-kullaniyorum/</link><guid isPermaLink="false">5ff2308c8fbbf80001f8edf2</guid><category><![CDATA[Linux]]></category><category><![CDATA[Ubuntu]]></category><category><![CDATA[OS]]></category><dc:creator><![CDATA[Gökhan Geyik]]></dc:creator><pubDate>Wed, 21 Dec 2016 12:15:00 GMT</pubDate><media:content url="https://www.gokhangeyik.net/content/images/2021/01/people-united-ubuntu.jpg" medium="image"/><content:encoded><![CDATA[<img src="https://www.gokhangeyik.net/content/images/2021/01/people-united-ubuntu.jpg" alt="Neden Ubuntu Kullan&#x131;yorum"><p>Bu konuda yaz&#x131;lm&#x131;&#x15F; binlerce makale oldu&#x11F;u a&#x15F;ikar. Ancak herkesin kendince bir nedeni oldu&#x11F;u da ortada. Bu nedenle hemen hemen t&#xFC;m projelerde Ubuntu kullanmam&#x131;n nedenini anlatmaya karar verdim.</p><p>A&#x15F;a&#x11F;&#x131; yukar&#x131; 13 y&#x131;ld&#x131;r sistemler y&#xF6;netiyorum. Dolay&#x131;s&#x131;yla bir &#xE7;ok projenin i&#xE7;erisinde bulundum ve bulunmaya devam ediyorum. Etraf&#x131;mda bir &#xE7;ok arkada&#x15F;&#x131;m Ubuntu&apos;ya olan d&#xFC;&#x15F;k&#xFC;nl&#xFC;&#x11F;&#xFC;me &#x15F;a&#x15F;&#x131;r&#x131;yor. &#xD6;zellikle 10 y&#x131;l gibi bir s&#xFC;re <a href="https://www.freebsd.org/?ref=localhost">FreeBSD</a> ile &#xE7;al&#x131;&#x15F;m&#x131;&#x15F; birinin <a href="https://www.ubuntu.com/?ref=localhost">Ubuntu</a> tercihini yad&#x131;rg&#x131;yorlar.</p><h3 id="-o-unlu-un-tercihi-do-ru-olmak-zorunda-degildir-">&#xC7;o&#x11F;unlu&#x11F;un tercihi do&#x11F;ru olmak zorunda degildir.</h3><p>Ayn&#x131; zamanda piyasadaki CentOS d&#xFC;&#x15F;k&#xFC;nl&#xFC;&#x11F;&#xFC; ortada. &#xD6;nceden yap&#x131;land&#x131;r&#x131;lm&#x131;&#x15F; ve &#xE7;al&#x131;&#x15F;an bir &#xE7;ok projede kar&#x15F;&#x131;la&#x15F;t&#x131;&#x11F;&#x131;m da&#x11F;&#x131;t&#x131;m CentOS. Bu yaz&#x131;y&#x131; da&#x11F;&#x131;t&#x131;m ya da farkl&#x131; i&#x15F;letim sistemlerini &#xE7;arp&#x131;&#x15F;t&#x131;rmak niyetinden uzak tutarak bitirmeye &#xE7;al&#x131;&#x15F;aca&#x11F;&#x131;m. Ancak muhtemelen baz&#x131; noktalarda olacak olan bu.</p><p>&#xC7;al&#x131;&#x15F;maya ba&#x15F;lad&#x131;&#x11F;&#x131;m ilk &#x15F;irkette FreeBSDler ile kar&#x15F;&#x131;la&#x15F;t&#x131;m. O s&#x131;ralarda FreeBSD tecr&#xFC;bem yok denecek kadar azd&#x131;. Zaman i&#xE7;erisinde elbette ha&#x15F;&#x131;r ne&#x15F;irli&#x11F;im artt&#x131; ve 10 y&#x131;l&#x131;m ge&#xE7;ti. Bir s&#xFC;r&#xFC; farkl&#x131; servisi &#xFC;zerinde geli&#x15F;tirdik ve yay&#x131;nlad&#x131;k. Elimizdeki sunucular &#x15F;imdi ile k&#x131;yaslanamayacak kadar k&#xFC;&#xE7;&#xFC;k donan&#x131;mlard&#x131;. Hepi topu 512MB RAMi bulunan Pentium 3 sunucular ile bir &#xE7;ok i&#x15F; ba&#x15F;ar&#x131;lm&#x131;&#x15F;t&#x131;. Zaman&#x131;na g&#xF6;re FreeBSD olduk&#xE7;a &#xF6;nemli avantajlar sa&#x11F;l&#x131;yordu. Bunlar&#x131;n en ba&#x15F;&#x131;nda da s&#xFC;phesiz <a href="https://www.freebsd.org/ports/?ref=localhost">ports tree</a> geliyor. M&#xFC;mk&#xFC;n olan hemen her&#x15F;eyi biraz daha optimize olarak yeniden derlemek performans anlam&#x131;nda u&#xE7;urum kenar&#x131;nda olan bu sunuculara olduk&#xE7;a iyi geliyordu.</p><p>Fakat y&#x131;llar ge&#xE7;ti ve donan&#x131;m daha ucuza ula&#x15F;&#x131;labilir bir hal almaya ba&#x15F;lad&#x131;. Yat&#x131;r&#x131;m konusunda cimri davranan &#x15F;irketi buna ikna etmek ne kadar zor oluyorsa da eskisi kadar sefalet i&#xE7;inde de&#x11F;ildik. Donan&#x131;m kayna&#x11F;&#x131;m geni&#x15F;leyince uzun suren compiling partilerine daha az ihtiya&#xE7; duymaya ba&#x15F;lad&#x131;m. Hi&#xE7; bir CFLAG biraz daha RAMin ve CPU&apos;nun verdi&#x11F;i hazz&#x131; sa&#x11F;layamad&#x131; elbette. Dolay&#x131;s&#x131;yla binary packed daha &#xE7;ekici bir hal almaya ba&#x15F;lad&#x131;. Hele ki sanalla&#x15F;t&#x131;rma teknolojileri ile birlikte i&#x15F;in rengi iyiden iyiye FreeBSD ekseninden kayd&#x131;.</p><p>Elbette tek nedeni bu de&#x11F;il ama konuyu s&#xFC;nd&#xFC;rmek istemiyorum. &#x130;lk olarak Open SUSE ile ilgilenmeye ba&#x15F;lad&#x131;m. Bunun tek nedeni SUSE Studio denen harika araca sahip olmas&#x131;. Ancak &#xF6;zellikle OS upgradelerde ya&#x15F;att&#x131;&#x11F;&#x131; anlams&#x131;z &#xE7;ile ve istedi&#x11F;im paket &#xE7;e&#x15F;itlili&#x11F;ini bulamad&#x131;&#x11F;&#x131;m i&#xE7;in k&#x131;sa s&#xFC;rede kendisi ile yollar&#x131;m&#x131;z&#x131; ay&#x131;rd&#x131;k.</p><h3 id="archlinux-pi-manl-kt-r-">Archlinux pi&#x15F;manl&#x131;kt&#x131;r!</h3><p>K&#x131;sa bir s&#xFC;re &#xE7;ok da istemedi&#x11F;im <a href="https://www.archlinux.org/?ref=localhost">Archlinux</a> ile &#xF6;nemli bir proje yapt&#x131;k ve an&#x131;nda a&#x11F;z&#x131;m&#x131;z&#x131;n pay&#x131;n&#x131; ald&#x131;k. Bela isteyen productionda kullanabilir.</p><p>Debian bir tercih olabilirdi ancak kat&#x131; &#xF6;zg&#xFC;r yaz&#x131;l&#x131;m gestapolu&#x11F;u beni hep rahats&#x131;z etmi&#x15F;tir. Ne kadar rahats&#x131;z olsam da Debian Package Manager hep m&#xFC;kemmeldi. Bu s&#x131;ralar Redhat furyas&#x131; y&#xFC;z&#xFC;nden CentOS g&#xF6;z &#xF6;n&#xFC;ne &#xE7;&#x131;kmaya ba&#x15F;lam&#x131;&#x15F;t&#x131;. Hatta yer yer Scientific de ayn&#x131; &#x15F;ekilde.</p><p>Redhat ile 98&apos;de tan&#x131;&#x15F;m&#x131;&#x15F;t&#x131;m. O zamandan bu zamana &#xF6;zellikle paket y&#xF6;neticisinde devrimsel bir de&#x11F;i&#x15F;iklik g&#xF6;remiyorum a&#xE7;&#x131;k&#xE7;as&#x131;. Halen ba&#x11F;&#x131;ml&#x131;l&#x131;k y&#xF6;netimini geriye d&#xF6;n&#xFC;k yapam&#x131;yor bu RPM tabanl&#x131; da&#x11F;&#x131;t&#x131;mlar. Kald&#x131;rd&#x131;&#x11F;&#x131;m bir paketin bin adet kulland&#x131;&#x11F;&#x131; k&#xFC;t&#xFC;phaneyi diskimde g&#xF6;rmek istemiyorum. Ancak ne CentOS ne de di&#x11F;er RPM tabanl&#x131;lar bunu asla y&#xF6;netemedi. Bildi&#x11F;im kadar&#x131;yla da halen y&#xF6;netemiyorlar.</p><p>&#xD6;zellikle en pop&#xFC;ler olan CentOS&apos;un bu konuda bir hamle yapmas&#x131;n&#x131; beklerdim ama maalesef. &#xD6;te yandan paket s&#xFC;r&#xFC;mlerinin oluk&#xE7;a eski olmas&#x131; da itici taraflar&#x131;ndan biridir benim i&#xE7;in.</p><p>Araya bir bilgi vermek gere&#x11F;i ile konuyu ilgili olarak b&#xF6;lece&#x11F;im. Bu bahsetti&#x11F;im da&#x11F;&#x131;t&#x131;mlar ve daha fazlas&#x131;yla ilk kez tan&#x131;&#x15F;&#x131;yor de&#x11F;ildim. Y&#x131;llar i&#xE7;erisinde 10larca da&#x11F;&#x131;t&#x131;m&#x131; gerek ki&#x15F;isel bilgisayar&#x131;mda gerekse projelerde zaten kulland&#x131;m. Bu kararlar&#x131; al&#x131;rken de t&#xFC;m bu tecr&#xFC;belerin birikimlerinden faydaland&#x131;m.</p><p>Sonunda zaman zaman kulland&#x131;&#x11F;&#x131;m, hemen hemen hi&#xE7; ba&#x15F;&#x131;ma bela olmayan Ubuntu&apos;ya e&#x11F;ilmeye karar verdim. Ubuntu&apos;nun &#xE7;&#x131;k&#x131;&#x15F;&#x131; onu sunucularda kullanmak isteyecek insanlar&#x131; &#xFC;rk&#xFC;t&#xFC;yordu. Sanki o hep basit, pek i&#x15F;e yaramaz ve genellikle son kullan&#x131;c&#x131;y&#x131; hedefleyen bir da&#x11F;&#x131;t&#x131;m gibiydi. Fakat kullan&#x131;m&#x131; kolayla&#x15F;t&#x131;rmak i&#xE7;in g&#xF6;sterdikleri &#xE7;abay&#x131;, sunucu s&#xFC;r&#xFC;mlerinde de ger&#xE7;ekle&#x15F;tirmeyi ba&#x15F;ard&#x131;lar.</p><p>T&#xFC;m ba&#x11F;&#x131;ml&#x131;l&#x131;k y&#xF6;netimini yapabilen bir paket y&#xF6;netim sistemi mevcut. Ayn&#x131; zamanda son derece geni&#x15F; paket &#xE7;e&#x15F;itlili&#x11F;i sistem y&#xF6;neticisini yaln&#x131;z b&#x131;rakm&#x131;yor.</p><p>LTS s&#xFC;r&#xFC;mlerinin g&#xFC;ncelli&#x11F;i, herhangi bir CentOS s&#xFC;r&#xFC;m&#xFC;nden bile daha g&#xFC;ncel. LTS ya da ara s&#xFC;r&#xFC;mlere upgrade inan&#x131;lmaz kolay. &#xD6;te yandan 3. parti geli&#x15F;tiricilerin kesinlikle Ubuntu repositoryleri mevcut. Art&#x131;k yava&#x15F; yava&#x15F; standartlar&#x131; koymaya ba&#x15F;lad&#x131; diye d&#xFC;&#x15F;&#xFC;n&#xFC;yorum.</p><p>T&#xFC;m da&#x11F;&#x131;t&#x131;mlar&#x131; inceledim diyemem ancak systemd d&#xF6;n&#xFC;&#x15F;&#xFC;m&#xFC;n&#xFC; olduk&#xE7;a h&#x131;zl&#x131; yapm&#x131;&#x15F; ve geriye d&#xF6;n&#xFC;k uyumlulu&#x11F;u olduk&#xE7;a iyi sa&#x11F;lam&#x131;&#x15F; bir da&#x11F;&#x131;t&#x131;m Ubuntu. Stock paketlerinin &#xF6;n tan&#x131;ml&#x131; konfig&#xFC;rasyon dosyalar&#x131;n&#x131;n zenginli&#x11F;i ve maintainerlar taraf&#x131;ndan yap&#x131;lan minik konfigurasyon ara&#xE7;lar&#x131;... Ger&#xE7;ekten hayat&#x131; kolayla&#x15F;t&#x131;r&#x131;yor.</p><p>&#xDC;zerinde neredeyse 100 Gbite varan trafikler d&#xF6;nd&#xFC;ren web servislerinden tutun da videolar&#x131; i&#x15F;leyen CPU/GPU k&#xFC;melerine kadar bir &#xE7;ok alanda Ubuntu tercih ediyorum. CentOS kullanan ve Ubuntuya g&#xF6;&#xE7;en &#xE7;ok ki&#x15F;i g&#xF6;rd&#xFC;m ancan Ubuntu&apos;tan g&#xF6;&#xE7;e hi&#xE7; rastlamad&#x131;m.</p><p>Uzun laf&#x131;n k&#x131;sas&#x131;, <strong>Ubuntu</strong> kullanmamak i&#xE7;in bir neden g&#xF6;remiyorum.</p>]]></content:encoded></item><item><title><![CDATA[Mr. Robot ve Maalesef Yine Hollywood Computer]]></title><description><![CDATA[Yeni ve güzel bir diziden bahsetmek için niyetlendiğim bu yazıda, yeni yine yeniden bir Hollywood Computer vakasıyla karşı karşıya kaldığım için çok üzgünüm.]]></description><link>https://www.gokhangeyik.net/mr-robot-ve-maalesef-yine-hollywood-computer/</link><guid isPermaLink="false">600c15932c753b0001890443</guid><category><![CDATA[Hayat]]></category><category><![CDATA[Dizi]]></category><dc:creator><![CDATA[Gökhan Geyik]]></dc:creator><pubDate>Sun, 28 Jun 2015 16:15:00 GMT</pubDate><media:content url="https://www.gokhangeyik.net/content/images/2021/01/hacker-room.jpg" medium="image"/><content:encoded><![CDATA[<img src="https://www.gokhangeyik.net/content/images/2021/01/hacker-room.jpg" alt="Mr. Robot ve Maalesef Yine Hollywood Computer"><p>Yaz&#x131;n&#x131;n i&#xE7;inde baz&#x131; teknik terimler olabilir, hemen s&#x131;k&#x131;lmay&#x131;n. As&#x131;l amac&#x131;m diziden bahsetmek. Spoiler ba&#x15F;lad&#x131;&#x11F;&#x131;nda haber verece&#x11F;im.</p><p>Yeni ve g&#xFC;zel bir diziden bahsetmek i&#xE7;in niyetlendi&#x11F;im bu yaz&#x131;da, yeni yine yeniden bir Hollywood Computer vakas&#x131;yla kar&#x15F;&#x131; kar&#x15F;&#x131;ya kald&#x131;&#x11F;&#x131;m i&#xE7;in &#xE7;ok &#xFC;zg&#xFC;n&#xFC;m.</p><h2 id="hollywood-computer-nedir">Hollywood Computer Nedir?</h2><p>&#x130;&#xE7;erisinde Hacking v.b bilgisayar teknilojileri unsurlar&#x131;n&#x131; konu edinen dizi veya filmlerde bolca kar&#x15F;&#x131;la&#x15F;t&#x131;&#x11F;&#x131;m&#x131;z kurgu bilgisayarlard&#x131;r. Her ne hikmetse bu bilgisayarlar asla bizim kulland&#x131;klar&#x131;m&#x131;za benzemezler.</p><p>M&#xFC;temadiyen ses &#xE7;&#x131;kar&#x131;rlar. &#xD6;te yandan, hen&#xFC;z 4-5 y&#x131;ld&#x131;r <a href="https://en.wikipedia.org/wiki/Compositing_window_manager?ref=localhost" rel="noopener">Compositing Desktop Manager</a>lar i&#x15F;lerini hakk&#x131;yla yapabilmeye ilk ad&#x131;m&#x131; atm&#x131;&#x15F; olsalar da, bu dizi ve filmlerde kullan&#x131;lan Hollywood bilgisayarlar&#x131; &#xE7;&#x131;lg&#x131;nd&#x131;r. Koca bir firman&#x131;n verisini ta&#x15F;&#x131;yan bir veritaban&#x131; sunucusunun aray&#xFC;z&#xFC;nde, neden 3D pencere efektleri olmal&#x131; diye kimse sormam&#x131;&#x15F;t&#x131;r.</p><figure class="kg-card kg-embed-card"><iframe width="356" height="200" src="https://www.youtube.com/embed/lhX4EER5BBk?feature=oembed" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe></figure><p>B&#xF6;ylesine g&#xFC;r&#xFC;lt&#xFC;c&#xFC; bilgisayarlar&#x131; g&#xFC;nl&#xFC;k hayat&#x131;n&#x131;zda kullanabilir misiniz? M&#xFC;mk&#xFC;n de&#x11F;il! Bu yaln&#x131;zca g&#xFC;r&#xFC;lt&#xFC; kirlili&#x11F;i. &#x130;&#x15F;in bir de ger&#xE7;ek hayata uygunsuzlu&#x11F;u s&#xF6;z konusu ki son y&#x131;llarda daha da rahats&#x131;z edici hale gelmeye ba&#x15F;lad&#x131;.</p><p>Uzunca bir s&#xFC;re ekranlarda g&#xF6;rd&#xFC;&#x11F;&#xFC;m&#xFC;z bilgisayarlar tamamiyle hayal &#xFC;r&#xFC;n&#xFC; ve tuhaf &#x15F;eylerdi. Gayet kullan&#x131;c&#x131; d&#xFC;&#x15F;man&#x131; arayuzleri ve g&#xFC;r&#xFC;lt&#xFC;c&#xFC; speakerlar&#x131;yla beynimizi t&#x131;rmalad&#x131;lar. Matrix Reloaded filminde bu i&#x15F; biraz farkl&#x131; bir boyut ald&#x131;. Bu kez filmde kullan&#x131;lan bir bilgisayarda, ger&#xE7;ek hayatta kulland&#x131;&#x11F;&#x131;m&#x131;z bir yaz&#x131;l&#x131;m yer al&#x131;yordu.</p><p>Bu filmde Trinity, <a href="https://nmap.org/?ref=localhost" rel="noopener">nmap</a> kulland&#x131;. Nmap i&#xE7;in &#xF6;zetle bir port taray&#x131;c&#x131;s&#x131; diyebiliriz. Bir IP adresinin online olup olmad&#x131;&#x11F;&#x131;ndan, &#xFC;zerinde &#xE7;al&#x131;&#x15F;an portlar&#x131; &#xF6;&#x11F;renebilmeye ve hatta baz&#x131; finger printler yard&#x131;m&#x131;yla, kar&#x15F;&#x131;daki cihaz&#x131;n i&#x15F;letim sistemini tahmin etmeye bile yard&#x131;m eden, harika bir yaz&#x131;l&#x131;md&#x131;r.</p><figure class="kg-card kg-image-card kg-width-wide kg-card-hascaption"><img src="https://www.gokhangeyik.net/content/images/2021/01/trinity-using-nmap.jpg" class="kg-image" alt="Mr. Robot ve Maalesef Yine Hollywood Computer" loading="lazy" width="1200" height="728" srcset="https://www.gokhangeyik.net/content/images/size/w600/2021/01/trinity-using-nmap.jpg 600w, https://www.gokhangeyik.net/content/images/size/w1000/2021/01/trinity-using-nmap.jpg 1000w, https://www.gokhangeyik.net/content/images/2021/01/trinity-using-nmap.jpg 1200w" sizes="(min-width: 1200px) 1200px"><figcaption>Matrix Nmap Scene</figcaption></figure><p>Konuyu Mr. Robot ekseninden &#xE7;&#x131;karmadan devam etmek istedi&#x11F;im i&#xE7;in nmap fasl&#x131;n&#x131; burada kapat&#x131;yorum.</p><p>Matrix&apos;te cereyan eden bu ger&#xE7;e&#x11F;e yak&#x131;n durum &#xE7;ok ilgi &#xE7;ekmi&#x15F;ti. &#xD6;zellikle bilgisayar geekleri bundan &#xE7;ok ho&#x15F;lanm&#x131;&#x15F;t&#x131;. Art&#x131;k filmlerde tamam&#x131;yla ger&#xE7;e&#x11F;e ayk&#x131;r&#x131; senaryolar ve durumlar &#xFC;zerinden y&#xFC;r&#xFC;m&#xFC;yorlar, hali haz&#x131;rda varolan pop&#xFC;ler yaz&#x131;l&#x131;mlar&#x131;n kendilerini de ekran kar&#x15F;&#x131;s&#x131;na &#xE7;&#x131;kar&#x131;yorlard&#x131;.</p><p>Bu kez de &#x15F;&#xF6;yle bir durum olu&#x15F;tu. Ger&#xE7;e&#x11F;e yakla&#x15F;mak amac&#x131;yla, ger&#xE7;ek sekt&#xF6;r terimleri ve durumlar&#x131; yarat&#x131;lmaya &#xE7;al&#x131;&#x15F;&#x131;l&#x131;rken daha &#xE7;ok mant&#x131;k hatalar&#x131; yap&#x131;lmaya ba&#x15F;land&#x131;.</p><p>&#x130;lk b&#xF6;l&#xFC;m&#xFC; yay&#x131;nlanan Mr. Robotu kesinlikle takip edecek olmam ve diziyi ilk b&#xF6;l&#xFC;m&#xFC;nden be&#x11F;enmem bir yana, malesef ger&#xE7;ek durumlar&#x131;n sa&#xE7;malamas&#x131; girdab&#x131;na girmi&#x15F; bulunuyor.</p><p><strong><em>Yaz&#x131;n&#x131;n buradan sonras&#x131;, tatl&#x131; tatl&#x131;, minik ve sevimli spoilerlar i&#xE7;erir.</em></strong></p><p>Dizideki ana karakterimiz bir security expert. Bordro mahkumu olarak bir &#x15F;irkette &#xE7;al&#x131;&#x15F;&#x131;yor. Ancak ayn&#x131; zamanda geceleri anonim oluyor ve &#xE7;&#x131;lg&#x131;n hackler yap&#x131;yor. E&#x11F;er &#xE7;ok iyiyseniz kesin ileti&#x15F;im sorunlar&#x131;n&#x131;z olmal&#x131;d&#x131;r kli&#x15F;esini de pas ge&#xE7;memi&#x15F;ler. Karakterimiz, insanlarla ileti&#x15F;im sorunlar&#x131; ya&#x15F;&#x131;yor.</p><p>Velhas&#x131;l g&#xFC;n geliyor ve ana karakterimizin &#xE7;al&#x131;&#x15F;t&#x131;&#x11F;&#x131; firman&#x131;n m&#xFC;&#x15F;terisi bir sald&#x131;r&#x131; al&#x131;yor. Asl&#x131;nda sald&#x131;r&#x131; senaryosunu sevdim. Sald&#x131;rgan &#xF6;nce <a href="https://tr.wikipedia.org/wiki/Ddos?ref=localhost" rel="noopener">DDoS</a> yap&#x131;yor ve dikkati ba&#x15F;ka noktaya &#xE7;ekiyor. Bu esnada o a&#x11F;da bulunan bir server, sald&#x131;rgan taraf&#x131;ndan rootlan&#x131;yor (ele ge&#xE7;iriliyor).</p><p>Tabi ortal&#x131;k bu denli kar&#x131;&#x15F;&#x131;kken, rootland&#x131;&#x11F;&#x131;n&#x131;n fark&#x131;na varmak pek kolay de&#x11F;il. Fakat ana karakterimiz cevval. Bunu anl&#x131;yor ve sunucular&#x131; kapatmam&#x131;z gerek, temizleyip tekrar a&#xE7;ar&#x131;z fikrini ortaya at&#x131;yor.</p><p>&#x130;&#x15F;veren bu duruma s&#x131;cak bakm&#x131;yor ve sunucular&#x131;n kapanmas&#x131;n&#x131;n imkans&#x131;z oldu&#x11F;unu s&#xF6;yl&#xFC;yor. A benim can&#x131;m! Zaten down de&#x11F;il misiniz? Fiziksel olarak kapatsan ne olacak? Zaten sen ofisine gelene kadar 3 saat ge&#xE7;mi&#x15F;. </p><p>Cevval adam&#x131;m&#x131;z o s&#x131;rada neler oldu&#x11F;unu anlamaya &#xE7;al&#x131;&#x15F;&#x131;yor ve ekran&#x131;ndan bir g&#xF6;r&#xFC;nt&#xFC; yans&#x131;yor.</p><figure class="kg-card kg-image-card kg-width-wide kg-card-hascaption"><img src="https://www.gokhangeyik.net/content/images/2021/01/mr-robot-console.jpg" class="kg-image" alt="Mr. Robot ve Maalesef Yine Hollywood Computer" loading="lazy" width="2000" height="1250" srcset="https://www.gokhangeyik.net/content/images/size/w600/2021/01/mr-robot-console.jpg 600w, https://www.gokhangeyik.net/content/images/size/w1000/2021/01/mr-robot-console.jpg 1000w, https://www.gokhangeyik.net/content/images/size/w1600/2021/01/mr-robot-console.jpg 1600w, https://www.gokhangeyik.net/content/images/size/w2400/2021/01/mr-robot-console.jpg 2400w" sizes="(min-width: 1200px) 1200px"><figcaption>Mr. Robot&apos;s Console</figcaption></figure><p>Tuhaf bir &#xE7;&#x131;kt&#x131;. Bir sunucuda neden Xorg &#xE7;al&#x131;&#x15F;&#x131;r? Hadi ihtiya&#xE7; has&#x131;l oldu &#xE7;al&#x131;&#x15F;t&#x131;rd&#x131;n. Niye root ile &#xE7;al&#x131;&#x15F;t&#x131;rd&#x131;n? &#xD6;te yandan, PIDlerin tutars&#x131;zl&#x131;&#x11F;&#x131;n&#x131; farkettiniz mi? &#xD6;zellikle <code>terminal</code> ve <code>websrv1FF1</code> processlerine g&#xF6;z at&#x131;n. Farkeden buyursun yorumlarda konu&#x15F;al&#x131;m.</p><p>Aman neyse, belki de sald&#x131;rgan yapt&#x131; onu diye d&#xFC;&#x15F;&#xFC;nd&#xFC;m. Rootkitinin ad&#x131;n&#x131; Xorg yapm&#x131;&#x15F;t&#x131;r dedim. Her ne kadar salakl&#x131;k olsa da olsun. Ger&#xE7;e&#x11F;e yak&#x131;n senaryolar &#xFC;rettikleri i&#xE7;in mutlu olmaya ba&#x15F;lad&#x131;m yeniden.</p><p>&#xC7;ok ge&#xE7;meden 2. bomba geldi. Sunuculara uzaktan eri&#x15F;im yapamamaya ba&#x15F;lad&#x131;klar&#x131;n&#x131; farkettiler. Mecburen ilk duruma d&#xF6;nd&#xFC;ler. Sunucular&#x131; kapat&#x131;p temizleyecekler ve tek tek online hale getirecekler.</p><p>Patron dedi ki: </p><blockquote>&quot;Bize jet laz&#x131;m! Veri merkezine gidiyoruz.&quot;</blockquote><h3 id="ne-laz-m-pardon">Ne &#xA0;Laz&#x131;m? Pardon?</h3><p>Yahu sene 2015. Jet kiralamay&#x131; biliyorsunuz ama 100$&apos;a bir tane <a href="https://tr.wikipedia.org/wiki/KVM_switch?ref=localhost" rel="noopener">KVM Switch</a> alamad&#x131;n&#x131;z m&#x131;? &#xC7;ok sa&#xE7;ma bir i&#x15F;ti. Velhas&#x131;l gece yar&#x131;s&#x131; kalkt&#x131;lar gittiler.</p><p>Veri merkezinde ise &#xF6;zlenen g&#xF6;r&#xFC;nt&#xFC; kar&#x15F;&#x131;m&#x131;zdayd&#x131;. Bu kez olay&#x131; biraz de&#x11F;i&#x15F;tirmi&#x15F;ler.</p><p>Kar&#x15F;&#x131;n&#x131;zda Hollywood Network Monitoring!</p><figure class="kg-card kg-image-card kg-width-wide kg-card-hascaption"><img src="https://www.gokhangeyik.net/content/images/2021/01/hollywood-network-monitoring.jpg" class="kg-image" alt="Mr. Robot ve Maalesef Yine Hollywood Computer" loading="lazy" width="2000" height="1250" srcset="https://www.gokhangeyik.net/content/images/size/w600/2021/01/hollywood-network-monitoring.jpg 600w, https://www.gokhangeyik.net/content/images/size/w1000/2021/01/hollywood-network-monitoring.jpg 1000w, https://www.gokhangeyik.net/content/images/size/w1600/2021/01/hollywood-network-monitoring.jpg 1600w, https://www.gokhangeyik.net/content/images/size/w2400/2021/01/hollywood-network-monitoring.jpg 2400w" sizes="(min-width: 1200px) 1200px"><figcaption>Hollywood Network Monitoring</figcaption></figure><p>&#xD6;yle haval&#x131; bir&#x15F;ey ki! &#x130;&#x15F;veren yaln&#x131;zca bu ekrana bakarak, hacker&#x131;n tam olarak nerede oldu&#x11F;unu g&#xF6;rebiliyor ve ba&#x11F;&#x131;r&#x131;yor &quot;<strong>Neredeyse yedeklere ula&#x15F;t&#x131;!</strong>&quot; Merak&#x131;n&#x131;z&#x131; hemen gidereyim. Evet bu monitoring yaz&#x131;l&#x131;m&#x131; da doyurucu oranda bipliyor.</p><p>Senaryolar&#x131; ger&#xE7;ek hayata yakla&#x15F;t&#x131;rmak, &#xF6;zellikle konuyla alakal&#x131; izleyicileri olduk&#xE7;a merakland&#x131;r&#x131;yor. Ancak inan&#x131;yorum ki zaman i&#xE7;erisinde bu bariz mant&#x131;k hatalar&#x131; ve gereksiz abart&#x131;lar da normalle&#x15F;ecektir.</p>]]></content:encoded></item></channel></rss>